[
    {
        "date": "01-01-1948",
        "startPage": "1",
        "endPage": "1",
        "text": "As a new year dawns, bringing to a close a most eventful centennial year, I wonder what 1948 will bring? National and international trouble is brewing; labor and price troubles at home and strained national ties with Russia. That nation, at this writing is a threat to world peace."
    },
    {
        "date": "01-02-1948",
        "startPage": "1",
        "endPage": "1",
        "text": "There will very probably be many changes at the P.O. this year. If the improved retirement legislation pending is passed by Congress there will be about 30 to 40 clerks retire from the roster.This year might find me working in an eastern office, perhaps Buffalo."
    },
    {
        "date": "01-04-1948",
        "startPage": "1",
        "endPage": "2",
        "text": "Attended Sunday School and fast meeting. It was an inspirational meeting. Two things I prayed I might succeed at; i.e. pay an honest tithe and magnify whatever job I might be asked to do by those in authority in the ward or state. I have been thinking about changing PO duty tour to day hours; 6:30 a.m. to 3:00 p.m. This would change my archive hours till say 3:30 till 9:30 p.m. but it would allow me at least one evening each week to devote to some sort of church service. I am dying spiritually mostly from a lack of activity."
    },
    {
        "date": "01-06-1948",
        "startPage": "2",
        "endPage": "3",
        "text": "Each weekday morning I spend two to three hours at the temple photographing and developing pictures as permanent records of temple ordinances;  this morning Bro Ernst Koehler, a German convert - a fellow I have never taken to - was helping in the absence of Vera Moore.  Well he passed out, momentarily and I thought he was either going to have a fit or go into a convulsion, but it passed quickly and he was normal again. He returns in the morning to Philadelphia where he is photographing old vital records. He works like a horse, only longer hours than a horse could take. I told him that if he didn't slow up, work normal 8-hour day and get some relaxation and recreation they would ship him home in a box, but I doubt if what I told him will receive any consideration and I'll wager he won't last very long if he doesn't heed my advice and the advice of his employers, the Genealogical Society. Having worked 5 hours on New Year's Day I took that amount of time off today; just window shopped, went to a show and took it easy. My left upper arm and shoulder have been aching some of late. I am sure it's on account of one or two bad teeth. Little Barbara hasn't been very well these past two or three days; seems to have canker or is cutting some double teeth. She has a sore mouth, cries a lot at night.I am attaching a clipping which is self-explanatory and shows the degree of inflated food prices, other commodity prices are as high or higher as well as rent and property values."
    },
    {
        "date": "01-07-1948",
        "startPage": "4",
        "endPage": "5",
        "text": "I wrote and posted a letter today to Mr Huson, clerk in the Sioux City office, who, according to the three-way trade plans will come to Salt Lake City. Mr. Carson, the Buffalo clerk, has not yet answered my letter of last Nov. or Dec. There is a tour open for competitive bid in the Registry Section with part P.M. hours and part A.M. hours. Two days each week the clerk reports at 3:00 P.M. and works till 11:30 P.M., one day each week he reports at 2:00 P.M. and works until 10:30 P., one day each week he reports at 9:00 AM and works until 5:30 PM and one day each week alternating week he reports at 6:30 AM and works until 3:00 PM and the following week he reports at 10:00 AM and works until 6:30 PM. I believe I could hold this job and get in about the same amount of hours at the archive and have one evening each week for church activity of some kind which I badly need."
    },
    {
        "date": "01-09-1948",
        "startPage": "5",
        "endPage": "5",
        "text": "Since the 3rd, or thereabouts, we have been having spring like weather. There is no snow and the temperature daily levels around 50°. About the 11th we can expect old man Winter to return; the moon changes then. The other day - this week - we got our old washing machine from the repair shop. they rebuilt it, made a new looking washer of it. The man said it should be okay for another 18 years now. I am looking forward to the forthcoming year of study of the Book of Mormon in the Gospel Doctrine class in Sunday school."
    },
    {
        "date": "01-12-1948",
        "startPage": "5",
        "endPage": "6",
        "text": "It was a lot colder today. Sonny turned 16 today. Too smart to go to school and too childlike to hold a job; just sleeps and loafs. He pays no heed to me whatsoever, comes and goes as he pleases, I doubt if he will ever be able to adjust himself in the world and I doubt if he ever earns an honest living for very long."
    },
    {
        "date": "01-17-1948",
        "startPage": "6",
        "endPage": "7",
        "text": "It was my turn to work a Saturday today. The weather is ideally spring like and balmy. Not at all like January. For the first time in many years I am caught up with my temple work. I have gone entirely through my record, and save for a very few group sheets now ready for cleaning, I am all cleaned up. My next objective is to begin doing some earnest research on the Henry, Howard, Colt, Butler or other line or lines now. My Heavenly father has blessed me marvelously in the past years, placing in my hands as it were, the records of thousands of my forebears. I am sure that as there are yet unnumbered thousands whose records are unknown at this time, he will also Place many of their records into my hands if I continue humble and prayerful and diligently seek for those records. I am particularly anxious to find some clue that will lead to the records of the ancestors of Dr Michael Henry of Lansingburgh, New York, one of my second great grandfathers. At present my knowledge of him is very limited. He was a resident of Lansingburgh when he married Abigail Haggard 10 July 1788 at Fairfield, Connecticut. He died at Lansingburgh 1811. He had served as a surgeon in the revolution and was a leading Presbyterian in a Rensselaer County."
    },
    {
        "date": "01-18-1948",
        "startPage": "7",
        "endPage": "8",
        "text": "It was 18 years ago today that my father died at the family residence in Rexburg, Idaho, following a serious illness of only a day's duration. He had had a bad heart condition for near 10 years but it was not that so serious.     My father was a pioneer of the Upper Snake River Valley. I don't know the time of his arrival there, but it was, I presume soon after his uncle Dick Jardine went there which was 1881 or 1882. Father went up there in 1884 or 1885 when a boy of about 14 years. He had been an orphan since 1881 when his mother died. His father, who he did not remember, died in early 1873. He had poor rearing - in fact so far as I can learn he had no rearing from his mother. He spent most of his pre-marital years from before the death of his mother, with his grandmother Ellsworth. During his early manhood years both before and after his marriage he was employed a lot by his Uncle Ed Ellsworth, a none-too-honest a man, who used to take advantage of his timid, afraid to stand up for his own rights, easily led nephew. Father has said that always his dealings with his uncle left him in the little end of the horn. My father had a hard life. As I have said many times, if he was on a truck digging job he was in the bottom where the mud was the deepest, where the work was the hardest and where it was the hottest. How oft I have wished he could have worked with me where the work is easy and agreeable and interesting."
    },
    {
        "date": "01-25-1948",
        "startPage": "9",
        "endPage": "13",
        "text": "We had a most bitter quarrel, Grace and I, last night. I packed some stuff in two bags and left. I had only 10 cents in cash so couldn't get a room. I left the bags at the archive and thought I would sleep there on a cot in the lady's lounge but a janitor worked there cleaning nearly all night so I sat up in the lobby of the Hotel Utah, went over to the archive at 7:00 a.m. and laid down and slept until 10:00. At 2:00, being starved I went down to the PO and had a sandwich, some cookies, a roll and a bottle of pop. This evening, being again at the archive I walked down to the 17th Ward to Sacrament meeting, saw a few of the old timers. After 13 years the faces change. Immediately associated the interior of the beautiful old place with my beloved friend, Bishop Nicholas G. Smith. I could see him in my mind's eye sitting on the rostrum , standing at the pulpit, going up the steps with that sort of hop or skip which characterized any quick or hurried move he made. I cannot put into words the feelings that seeing the old chapel, which holds so many treasured memories, brought afresh from my memory. It was there that I first stood on my feet and with fear and fathering bore my testimony for the first time. Brother Hiram M. Jaglar, a patriarch now deceased, sat beside me and encouraged me to arise. I attended my meetings regularly there for some seven years. They were the happiest years of my life. I have never seemed to fit into any ward like I did the old 17th, that, I am sure, is because I haven't been as faithful in paying my tides and offerings as I then was. Oh that I could, Heavenly Father, be as good a Latter-Day Saint again as I then was or even better. With memories so refreshed I banished, or tried to banish, the ill feeling I had for Grace and in spite of the fact that she refused to talk to me when I called home on the phone, I came back like a licked pup, like a little boy would do when he got hungry. Tonight, here in my comfortable home I want to express in a few simple words how grateful I am to my Heavenly Father for his abundant blessings during the past 20 years, or nearly so. During those early years he gave me richly of his spirit, the spirit of repentance, the spirit of fellowship with my fellow man. He gave me the holy priesthood which I have endeavored to carry with dignity and honor and all in all so enriched my poor life that I became vibrant, alive and happy. As I reflect upon those happy days I realize the inroads Satan has made toward my spiritual destruction, which brings me to say: God help me to overcome the evil one, that his purposes to destroy me shall fail and that I come off in the end the victor. Please, Heavenly Father, bless me that I overcome this terrible temper I have developed. Please also bless me that somehow, with thy help, I can reestablish family prayers in my home. That I learn patience, tolerance, kindness, forbearance and charity: I ask in Jesus' name: Amen. A fierce, cold winter blast is blowing tonight. Makes one thankful to have a warm, cozy home."
    },
    {
        "date": "01-26-1948",
        "startPage": "13",
        "endPage": "14",
        "text": "It has been very cold today and this evening is nearly as cold as last night. How terrible it would be not to have a warm house in such bitter cold weather. There are thousands of families of Europeans who do not have fuel nor enough clothing nor bedding to keep them warm. I am thrilled with the genealogy I am gathering of families I either overlooked when compiling my record or neglected to make family group sheets for them. Mama hasn't spoken to me since I returned home. I can't blame her. When I think about our terrible scene I am mortified with shame. I would like to tell her how ashamed I am of myself, but probably to say anything would be worse than saying nothing. I hope and pray that my heavenly father will help me to overcome my bad temper. I got angry far too easy. I would like to be like the biblical statement which says \"he who control with his spirit is greater than he who takes a city.\""
    },
    {
        "date": "01-27-1948",
        "startPage": "14",
        "endPage": "14",
        "text": "Since Sunday my plans for the future, the immediate future, have been reformed. I'd rather not reveal to Satan's eyes what those plans are. So long as I say nothing and write nothing he has no way of knowing, because he does not possess that divine gift held by our Heavenly Father and his Son of seeing or knowing men's hearts."
    },
    {
        "date": "01-28-1948",
        "startPage": "14",
        "endPage": "16",
        "text": "We should have been paid yesterday according to the schedule of the past, but Will Holmes, secretary to Bishop Meyers has been sick hence our pay has been delayed. We hope we get it tomorrow. Last Sunday evening I was at the archive just prior to returning home. While I was there the night man came into the building to ring his hourly clock and he saw me. There was quite a to do about it today. I don't know why he waited until today, the final analysis was I and he met with Bishop Isaacson of the Presiding Bishopric where the affair was all straightened out. Bro Robbins, the night watchman was badly embarrassed and was as red as a beat when Bishop Isaacson related in our hearing the story Bro Robbins head previously told Bishop Isaacson about running into a mean, vicious, burglar Sunday evening. I agreed to turn in my key - not that I was asked to - but I made the offer as a gesture of Faith to assure Bishop Isaacson that such an incident would not happen again. I could understand Bishop Isaacson's concern about the incident when I learned from him that only the night before someone broke into a safe in the genealogical building or the adjoining building and stole $280. When I go east this summer or fall I aim to take a side trip south from Washington DC down through Virginia, through Richmond and Norfolk to Elizabeth City North Carolina. When I reach St Louis on my return trip I aim to take a side trip down the Mississippi probably by train or bus to New Orleans. From there I aim to go eastward through Mobile, Alabama to Pensacola, Florida. I'd like to go south from St Louis on one side of the Mississippi and return to St Louis on the other. From the eastern bank of the Mississippi it is only a short jump maybe 100 miles over to the Texas border. If I can make these proposed side trips I will then have been in all the states of the Union except North Dakota, South Dakota, Minnesota, South Carolina and Georgia. As I once stated one of my ambitions is to go into each of the 48 states."
    },
    {
        "date": "01-29-1948",
        "startPage": "16",
        "endPage": "17",
        "text": "A pay raise for postal employees in the near future looks assured, judging from the response congressmen and senators have given our contact men throughout the country. The bills both ask, I think, for $800 increase in the annual salary. When this becomes effective I will draw, after July 1st $3900 or $325 monthly. Maybe next year we could get a car."
    },
    {
        "date": "01-30-1948",
        "startPage": "17",
        "endPage": "17",
        "text": "Our pay raise bill, when signed by the president, will be quite substantial and retroactive to January 1st. If we get the check for back pay say in April it should be a tidy sum and that sum I aim to stick in the bank toward beginning the trip east this fall. I have been sick with a bad cold since the first of the week, sleeping sitting in the lobby probably or lying for two or three hours Sunday AM in the ladies Lounge at the Genealogical Society last Sunday morning, or just being in mental rundown condition; worry."
    },
    {
        "date": "02-01-1948",
        "startPage": "18",
        "endPage": "19",
        "text": "It is a bright, beautiful spring-like day; warm and delightful. Charles and I attended our quorum meeting this morning, later Sunday School and later fast and testimony meeting. I've been thinking just since I started to write that we misspell and misuse the word \"bear\" with respect to testimonies. I am sure that it should be \"bare\" - to lay bare - to exhibit - to open to view. And never should we say \"he bore his testimony\" because \"bore\" is the past tense of \"bear\" while bared is the past tense of \"bare\". We should say \"he bared his testimony\". I am disappointed with Bro. Clegg, the newly appointed gospel Doctrine Sunday school class instructor. Today more than ever he let the class get out of hand, discussing pro and con subject matter apart from the outline, to no one's improvement. One particular point he raised today and said that the historical record would prove that the Prophet used a seer stone in conjunction with the Urim and Thummim. This I had never heard before and I doubt its truth. If the prophet found and used a seer stone to translate The Book of Mormon, what was wrong with the Urim and Thummim?"
    },
    {
        "date": "02-03-1948",
        "startPage": "19",
        "endPage": "19",
        "text": "Forty five years ago today my Great Grandmother Elizabeth Y. Ellsworth, died at her home in Lewisville, Idaho; in her 78th year. She died very suddenly of a heart ailment. In good health and in 5 minutes she was dead. Grandmother Ellsworth is my \"connection\" with the Prophet Joseph Smith; she is the only person who I know, or knew, who knew the great Mormon Prophet."
    },
    {
        "date": "02-04-1948",
        "startPage": "19",
        "endPage": "20",
        "text": "Harry Cross, a friend with whom I work at the PO and who for some months worked also at the Archive, was hit by a motorist Friday or Saturday evening and suffered a badly shattered left leg. His wife was with him at the time, she was knocked down and bruised but not seriously injured. These helter-skelter car drivers. About 50% of them have no business behind the wheel of a car. The sooner the state puts some stiff requirements in their driver's examination and some teeth in their careless driving convictions the sooner we'll see a decline in the highway accidents."
    },
    {
        "date": "02-06-1948",
        "startPage": "20",
        "endPage": "20",
        "text": "When will I get done the many jobs waiting on me while I work 13 hours per day? When will I be able to adequately provide for my family with 8 hours work? There remains lots of genealogical and temple work yet to do; there remains the work of completing my biographical sketches; their remains a lot of work to be done on the home to make it comfortable, homey and attractive and there remains considerable work on the outside of the house to beautify the lot, etc. When can I find the time to get all of this done?"
    },
    {
        "date": "02-08-1948",
        "startPage": "21",
        "endPage": "22",
        "text": "Today, having discovered how really bad Ardi's bedroom ???, we decided definitely to sell. Later in the day an agent from one of the realtors came with some prospective buyers and I told them we had cut the price to $8500. If we can get $8500 we will just about break even, but if we can sell it independent of realtors we will save 5% of the selling price. I am thoroughly disgusted with the place. It is poorly arranged, poorly heated, poorly constructed kitchen and bath, and needs a new roof real soon. Dot and Bryce and Craig were here this evening. Craig is a cute, healthy baby. When he smiled at me this evening I could see an expression of familiarity; an expression or look I had not seen in many, many years. Tonight, having planned for some 2 weeks, I'm going to write letters to 10 or 12 eastern postmasters asking for privilege of transferring or trading into their office. A favorable reply should come from at least one of them. I would like to get into Buffalo, Albany, Pittsfield, Hartford, Providence, New London, Bridgeport, New Haven, Rochester, Syracuse, or Troy office."
    },
    {
        "date": "02-09-1948",
        "startPage": "22",
        "endPage": "23",
        "text": "Last night I wrote 11 letters to as many postmasters in Buffalo, Albany, Rochester, Syracuse, Troy, Pittsfield, New London, Bridgeport, New Haven, Hartford and Providence. From at least one I should receive a favorable reply.    It is my plan to take Charles and Cathy east with me also my sister Rowennah as a housekeeper if Grace and I don't get along any better together during the ensuing 8 months than we have this past year. By that time I think I could be out of debt and free, so far as any creditors are concerned, to leave the state. During that period we could also sell our home. I would give Grace the proceeds from the sale to buy herself a home or whatever else she wished to buy with the $3,000. That would be a cash settlement. I could go back to living like a normal man; working 8 hours per day, getting some recreation each day and get 8 hours sleep out of 24. We would need a foot locker and two bags for our clothes. My books could be shipped ahead by parcel post. In whatever town we found ourselves we would find a branch of the Church and plenty of Church work to keep Charles and I busy. We would have family prayer at least once each day and the children would be taught to pray and keep the Commandments of the Lord. I could continue with my genealogical research work and Temple work just as though I lived in Salt Lake City. It is snowing this evening."
    },
    {
        "date": "02-12-1948",
        "startPage": "23",
        "endPage": "24",
        "text": "Today is a holiday at the Archives, being president Lincoln's birthday. However I have to work this P.M. At the P.O. This morning Grace and I have cleaned out the basement of a lot of junk; burned some and some we are giving to Mrs Wittenburg to send to Germany. The magazines and old newspapers I have bundled to go with the paper drive."
    },
    {
        "date": "02-13-1948",
        "startPage": "24",
        "endPage": "25",
        "text": "Ann Durham, wife of Bro. Alfred M. Durham, died Wednesday evening. Her funeral will be conducted tomorrow at Jos. William Taylor Mortuary. Ann  died from cancer. Brother Durham has buried two wives, his first, the mother of his children, died in 1931. He was then a councillor to Bishop Nicholas G. Smith of the 17th Ward. It looks like Ardie is going to Okinawa to join Frank. How soon she will be leaving I don't know, maybe within 30 days. When I go east this fall I am planning to take a side trip from Washington D.C. to Savannah, Ga. one way by water the other by rail or bus. With all the side trips I have planned for that trip I'll sure be busy. The first one along the way will be from Burlington, Ia to Carthage, Il via Nauvoo. The second will be from Chicago to Kenosha, Wis. just to add Wisconsin to my string of states. The next will be from Buffalo to Niagara Falls and another from Buffalo to Geneseo, N.Y. The next will be from Albany, N.Y. to Rutland, VT. The next from Boston to Berwick, ME. The next will be from Washington D.C. to Savannah, Ga. The next will be from St Louis to New Orleans and from New Orleans to Pensacola, Fla. This trip is with the proposed side trips will carry me into Wisconsin, Indiana, Michigan, Ohio, Pennsylvania, New York, Vermont, Massachusetts, New Hampshire, Maine, Rhode Island, Connecticut, Delaware, New Jersey, Maryland, Virginia, North Carolina, South Carolina, Georgia, West Virginia, Kentucky, Tennessee, Mississippi, Louisiana, Alabama, Florida, Arkansas. If I have the money and time when I get back to Denver I shall take a trip South through New Mexico, Oklahoma and into Texas. If I can do this I will have been in every state in the Union except North Dakota, South Dakota and Minnesota. A trip into the Northwest this summer will add Oregon and Washington to the list."
    },
    {
        "date": "02-14-1948",
        "startPage": "26",
        "endPage": "27",
        "text": "Mama and Kathy and I went to a show in Sugarhouse. Kathy was anxious to get back home so she wouldn't miss any Valentine's the kids might bring to her door. I did some research today on the James Harmison line.  He married two of the daughters of Gideon and Betsy Brownell. Fanny Elizabeth married first a William Steele in the endowment house - rather they were sealed in the endowment house having been previously married (I presume). Then in May 1870, 4 years after she had been sealed to Steele, she was sealed to James Harmison who had married her sister Mary Ann Experience. So to me it appears that she had divorced William Steele and had the sealing cancelled. One other daughter Hannah married William Vaughan. It appears that Vaughan and his wife did not join the Church and hence did not come west. There is no record of either of them in the Index Bureau nor in early Utah history. Another daughter presumably married Jesse Pierson, I can learn nothing about him either, and I don't know the name of his wife. Gathering this information is part of the project I am working on at present, of delving into heretofore uncompleted families of my direct ancestors. The present family is that of Gideon Brownell. With the work of \"gathering out\" these uncles and their wives and families and the aunts with their husbands and children, I am also to gather information necessary to complete the biographical sketches I have long since started, and so badly neglected. The Eastern tour, scheduled for early October will cost $115 for St Louis to Boston round trip and $100 for side trips and $100 for expenses. That's for one. If Grace goes it will cost nearly twice that."
    },
    {
        "date": "02-15-1948",
        "startPage": "27",
        "endPage": "30",
        "text": "My brother Orrin turned 46 today. I think he looks 5 to 10 years older than I. He has drunk enough liquor in the past 25 years to have bought and paid for a fine home, to say nothing of the damage it is done to him; spiritually and physically. I must write a short letter to Mother. I get angry when I think about the damnable, shabby way Rowenna has been treated during the past 20 years, just like she was poison or contaminated. I often think about an Old Testament prophecy which runs something like this: \"A mother might forsake her own, but I will never forsake thee, O House of Israel.\" It is a very serious offense to desert or forsake a child, throwing it upon the mercy of the state because of a mental or physical defect unless it should be mentally insane, I mean an insane criminal, one whose conduct could not be trusted, I think such people should, in fairness to themselves and their families, be placed in an institution, but to place a sweet, inoffensive little girl in such a place away from those who should give her the kindest care; is in my humble opinion, a criminal act and someday will have to be answered for before the judgment bar of the Great Judge. And it will not be easy. If my Heavenly Father will open my way before me I will take my sister out of that den and place her where she can live like a normal human being. I am worried about her. I haven't heard from her in weeks. I'm ashamed to say it, but the last few letters she wrote I did not read. They were destroyed, and now I don't know what she may have told me. Had I read them maybe the silence would have been explained. Her letters are childish and infantile which probably explains why I let them lay without reading them. About two weeks ago I sent her some writing paper and a supply of stamped envelopes. She, unlike her, has not acknowledged the little present. Later I wrote her a letter, telling her I was worried at her long silence. From that letter I have received no reply, which is very disturbing to me. I wonder if she is ill. I wonder if she is injured, or is it possible that she is no longer at the institution. I plan to go up to Nampa the end of next month and see Rowennah and learn by talking with her and by consulting with the authorities there if she is capable of keeping house and cooking."
    },
    {
        "date": "02-16-1948",
        "startPage": "30",
        "endPage": "30",
        "text": "Answers were received today from two of my letters. They came from postmaster Creegan of the Providence, R.I. office and postmaster Neary of the Bridgeport office. Both, however, were negative replies. They state that because their complement of clerks is filled they could not accept more as a transferee. I am doubtful now of receiving a favorable reply from any of the 10 unanswered requests."
    },
    {
        "date": "02-17-1948",
        "startPage": "30",
        "endPage": "31",
        "text": "My Grandfather Howard - John Hazard Howard - died 75 years ago today in Brigham Canyon. Three quarters of a century is a long time when measured by a man's lifetime. There is something mysterious and sinister about his death. I think, as did his parents, that there was foul play. Another reply was received today. It came from Patrick J Goode; postmaster at New Haven, Connecticut. He says he is posting my letter as that anyone desiring to trade to SLC can communicate with me direct. Probably my next move is to have an insertion put in the Union Postal Clerk - our national organization's magazine, telling where I want to trade to."
    },
    {
        "date": "02-18-1948",
        "startPage": "31",
        "endPage": "31",
        "text": "My pen is in the pen shop for a repair job. This is Grace's. I posted another letter today to Rowenna. Sure is darned strange about that girl. Hope she isn't sick or something worse. If I don't hear from her by Saturday I am going write to the Super of the school."
    },
    {
        "date": "02-20-1948",
        "startPage": "32",
        "endPage": "32",
        "text": "One of my letters, the first one, written to Rowennah last week or the week before, was returned to me today.The address I used was that furnished me by Rowennah and all of her letters, that is; Box 11. I am afraid something is wrong, but what? I am writing another letter tonight and will address it to State School. Since Wednesday I have received replies from two more postmaster letters. One from E.J. Dillon , Postmaster at Hartford and Donald A. Dailey, Postmaster at Rochester, N.Y.They both offer mutual trade privileges, but could not accept my application for transfer. I became ill this A.M. While working at temple. I came home about 5:00 P.M. It was one of those periodical bilious attacks, induced by eating too much homemade divinity last night."
    },
    {
        "date": "02-22-1948",
        "startPage": "32",
        "endPage": "33",
        "text": "Today is Aunt Mabel's birthday she is 85. Seems to be an excellent health. My cousin, Mary Collins dropped in on us today. With her came her son James, who is a little younger than Charles; her daughter Sharon and her son Maine, also a little nephew Stephen. Mary is divorced from Lewis, who I have an idea is trashy, shiftless and generally no good. She is selling Wear Ever,the outfit Grace and I stooged for so long, long ago. I didn't like them. Mary is a rustler and if anyone can succeed as a seller Mary can."
    },
    {
        "date": "02-24-1948",
        "startPage": "33",
        "endPage": "35",
        "text": "When I return to work today there were four letters there for me. They are from Timothy J. Sullivan, Postmaster at New London, Conn.; Myron J. Parkinson, Postmaster at Syracuse, New York; and John P. Hayes, Postmaster at Albany N.Y. The other letter is from Louis J. Kutz, a clerk in the Rochester office who says he wants to transfer to Penna or Northern New Jersey and hope so we can get a third party interested for a three-way trade. Of the 11 letters I wrote to eastern postmasters I have to date heard from 8 postmasters. Buffalo, Pittsfield and Troy offices haven't yet answered. I stopped at the Union Bus Depot today and learned that a round trip fare by bus from Washington, D.C. to Savannah will only cost me $17. Tomorrow I'll trouble them again (I didn't have time to wait today) and get the cost of a round trip bus fare from St Louis to New Orleans. It will be a little less than $17 I believe. The bus fare from New Orleans over to Pensacola shouldn't be more than $5. From Chicago to Milwaukee and return will be say $5; from Albany to Rutland and return $3; from Boston to Portland and return about $5; from Washington DC to Savannah and return $17; from St Louis to New Orleans and return $15 and from New Orleans to Pensacola and return $5 a total of $48 plus the fare from Denver to Dalhart Texas and return. This side trip will take me into New Mexico, Oklahoma and Texas."
    },
    {
        "date": "02-26-1948",
        "startPage": "35",
        "endPage": "36",
        "text": "Picked up my pen from Held's repair shop today. Seems okay, just a little scratchy perhaps. Vera Moore has been in the hospital three or four days resting up before undergoing an operation for goiter. She was badly run down and it had affected her heart. We are praying for her; that she shall be given strength to undergo the operation, that the operation will be successful in that in a short time she can return to her work. This morning before leaving for work I cleaned out the plugged goose neck in the basin and this evening I put a new washer on the hot water tap in the kitchen sink. Leree Baker, a friend since about 1936 and a widow since 1935, an employee of the temple with whom I work each morning, is being married this week. There is rumor at the Archive that we are going to have a new supervisor. I'll guess it will be Harold Jacobsen, an old time employee of the society who has just been discharged from the Army. I was thinking today as I was looking at a map of the US that I could go to Winona, Minnesota from Chicago thence to Milwaukee and back to Chicago for about $3 more than a round trip from Chicago to Milwaukee. If I did that and in addition took the side trip from Denver down to Dalhart and back and supposing I go up to Seattle this summer I should then have been in all of the states of the Union except North and South Dakota."
    },
    {
        "date": "02-27-1948",
        "startPage": "36",
        "endPage": "37",
        "text": "The bill, hiking postal employees pay $1000 per year looks good. It hasn't met any opposition yet. I feel we will get at least $800. That amount of raise would bring my annual pay to $3900 July 1st, when I will under the longevity plan, begin drawing $3100. The Czech government capitulated under heavy Red pressure the other day and the Communists took over the government. Their next move will be into Finland. What is happening in Europe today (which is of great import, and shows the nearness of the winding up scenes) will ere long happen right here in America."
    },
    {
        "date": "02-28-1948",
        "startPage": "37",
        "endPage": "38",
        "text": "I picked up a U.P. timetable today, thinking perhaps I would go east via the U.P. but since it misses Nauvoo farther than the CB&Q I'll take the Rio Grande and CB&Q into Chicago; from there I want to take the NY Central to N.Y. via Boston and the Pennsylvania from N.Y.C. to Washington D.C.I work today, will have Tuesday off as a comp day. It happens thus each 9th Saturday. I mean that each night Saturday I get a Tuesday coffee. The other two Saturdays I work I get Fridays as comp days. I am delighted with the amount of new family groups the new objective is adding to my genealogical record. I am sure that when the shuts are cleared I'll find that nearly all temple work will already have been done. I computed my outgo on debts today and I find that for at least 6 months to come I will have to pay out $80 per month. This includes $32.50 per month on borrowed money; $15 per month on merchandise and the balance is tithing.   The Prophet Joseph, prophesying in a letter which he wrote to a Mr Seaton, a publisher, that \"not many years shall pass away before the United States shall present such a scene of bloodshed as has not a parallel in the history of our nation; pestilence, hail, famine and earthquake will sweep the wicked of this generation from off the face of the land etc. D.H.C. Vol 1 pp 312-316"
    },
    {
        "date": "02-29-1948",
        "startPage": "39",
        "endPage": "42",
        "text": "How often does February have five Sundays? I guess it happens once in 28 years. I started up to the Vets hospital this evening but I found when I got into town that I couldn't make it by 8:15 (visitors are admitted from 7:15 till 8:15 P.M.). I inquired at the St Louis bus depot for round trip fare from St Louis to New Orleans. The fare is $21.85. Now $17 + $22 + $5 (Chicago to Milwaukee and return) plus $6 (Boston to Portland in return) plus the cost of a rented car to drive from Keokuk, Ia to Nauvoo and Carthage and return, which shouldn't be more than $10 plus about $4 from Albany to Rutland, Vt and return. All together total $64. My railroad fare will cost me $115, side trips (all by bus) $65 plus $100 for expenses totals $280. An extra $20 for incidentals makes $300. Considering that with or for that amount I can tour the US with the exception of Oregon, Washington, North Dakota, South Dakota, Minnesota, Texas, Oklahoma and New Mexico. As I have said before; if, when I get into Pueblo, Colo on my return trip, I have enough dough left I aim to take a side trip to Dalhart, Tex. which will take me through New Mex., Okla. and into Tex. I will then have been in 43 of the 48 states. Summer trip up to Seattle will make the total 45.   If only my Heavenly Father will let me make this trip. I should say these trips. I'm going to pray about it repeatedly until my Father in Heaven either gives me the assurance that it is all right or takes from me this indescribable obsession.   I want, oh so bad, to see Nauvoo, Carthage, my Great Grandfather's picture which hangs either in Lansing or Detroit, Mich (maybe both) Kirtland, Ohio, Geneseo, N.Y., Niagra Falls, N.Y., Mendon, N.Y., Aurelius, N.Y., Spencerport, N.Y., Port Byron, N.Y., Palmyra. Hill Cumorah and Sacred Grove at Manchester, Fayette, N.Y. (all of these [marked locations] can be reached in one days driving from Rochester). Lansingburgh, N.Y., Waterford, N.Y., Pittsfield and Hinsdale, Mass., Benson and Danby, Vt., Boston, Mass., Kingston or Point Judith R.I., Old Lyme, Westport, Hartford, Conn., New York City, Philadelphia, Washington, D.C., etc. I could leave St Louis say on a Thursday evening, having worked the early tour on a trade that day. I could be in Denver the following P.M. and would leave Denver that same P.M. at 4:00 and arrive at Burlington the next morning which would be Saturday. Previously having gotten in touch with some LDS brother by mail who resides in Burlington, and have him engaged to spend three or four hours driving me down to Nauvoo and Carthage and back to Burlington that P.M. at 5:00 when I would depart arriving in Chicago at 8:45 P.M. I would spend Sunday in Chicago would attend LDS services somewhere, then take a sight seeing trip, visit Grant Park and late that P.M. run up to Milwaukee and back. Monday when my vacation began I would be in Detroit and in Buffalo that same night. I attended all my meetings today."
    },
    {
        "date": "03-01-1948",
        "startPage": "42",
        "endPage": "44",
        "text": "March came in like a lamb. The weather was beautiful this morning; it is rather cold tonight.    Resuming my proposed trip schedule. By arriving in Chicago Saturday evening I could get a good night's rest, rise early and go up to Milwaukee for Sunday school, getting back to Chicago about 2:00 p.m., take a sight seeing tour, go to Sacrament meeting and later run out and visit with Katharina. Monday morning I would leave for Detroit, spend only a few hours there and be on my way again, arriving in Cleveland early enough to get a car and get out to Willoughby - or Kirtland. Spend Monday night in Cleveland, or if a later train could get me into Buffalo by 10:00 p.m. I'd go on thru. I would spend Tuesday in Buffalo going to city cemetery, visiting the Buffalo Savings Bank, looking around, see what is located at 611 Main St where Gt Grandfather used to live. Take a sightseeing ride and in the late afternoon go up to Niagara Falls. I would leave Buffalo Wednesday morning arriving at Rochester about 2 hours later. I'd spend Wednesday driving here and there about the surrounding countries, visiting the places I propose to see. Probably leave Rochester that evening and arrive at Albany at night late. I would spend Thursday visiting Troy, Lansingburgh, Waterford Cemetery and later catch a bus for Rutland, Vermont or rent a car and drive to Benson and Danby and return. I would like, however to spend a day in Benson visiting if I had the time to spare. Saturday I would spend in Pittsfield and Hinsdale. In Lansingburgh I would try to visit my great great grandfather Henry's grave, in Waterford I would try to visit my great-great-grandmother Henry's grave and the grave of her sister Mary Clift. In Hinsdale I would try to visit my great-great-grandfather Howard's grave. Sunday I would be in Boston in time to attend Sacrament meeting and maybe take a sightseeing ride. Sunday evening I would go up to Portland Maine and back the following day. One week of my three weeks vacation will be gone."
    },
    {
        "date": "03-02-1948",
        "startPage": "44",
        "endPage": "44",
        "text": "Little Frank is choked up terribly with croup. Charles has moved his folding roll-away bed into the basement where he now sleeps, sure leaves the dining room looking bare but much better. I'm too sleepy to do any more writing tonight."
    },
    {
        "date": "03-03-1948",
        "startPage": "44",
        "endPage": "45",
        "text": "I washed part of the kitchen this morning, will do some more of it tomorrow morning. I learned at the office of Internal Revenue yesterday that we owe $159 income tax on our 1947 income. When the state form is completed it will show we owe the state $20 to $30. My Heavenly Father, please let thy servant get out of debt, and please let me go east this fall and let me fix up my home like we wanted. I petition thee for these particular blessings in the name of my Redeemer: Amen."
    },
    {
        "date": "03-04-1948",
        "startPage": "45",
        "endPage": "46",
        "text": "Today my mother turned 65. She was born March 4th 1883 at Clarkston, Utah and when less than two months old her father moved his family and all of his worldly goods, which were meager, to the upper Snake River Valley, later the place was named Lewisville. Here she grew to womanhood and here she married my father when she was very young. I wrote a Mr Friedt an RMS clerk in the Washington DC Term. Who wants to trade to Salt Lake City. Washington isn't the place I had hoped to get into but it will do. Grace and I cannot get along for more than a week, then I get \"told off\". I am thoroughly disgusted with my home and my unappreciative family. My wife raises hell with me and then with the children, Ardis has lived - I should say sponged on us for near 2 years now while she steps out on her husband. There isn't a week goes by that she isn't out at least twice until the small hours of the morning. Her marriage will eventually go on the rocks and she will try to put the children onto her mother to raise. Sharon is away from home more than she is here, she hasn't slept at home for weeks, she is staying with her girlfriend whose mother is in the hospital; Sonny won't go to school and neither will he work - in this respect he and Sharon are alike. Charles is in hot water a lot of the time with his school officers and teachers because he doesn't want to go to school. My children are social misfits. They can't get along with anyone for very long.   I am about through with the lot of them. They can start supporting themselves or go hungry."
    },
    {
        "date": "03-05-1948",
        "startPage": "46",
        "endPage": "47",
        "text": "In about 7 months I hope to be leaving either on my vacation trip or to go to some eastern city to live. At any rate I plan to leave this city during the first week in October."
    },
    {
        "date": "03-06-1948",
        "startPage": "47",
        "endPage": "49",
        "text": "The project of finding the records of many of my uncles and aunts with their children has developed into a man-sized job. I know I was inspired to get into this neglected field of my genealogical responsibility. Hundreds whose records have never been brought to light and whose temple work they have long awaited will be accomplished thanks be to my Heavenly Father. It is an engrossing and stimulating work. It is the Lord's work, and whatever degree of success I realize from month to month, my Heavenly Father receives the honor and the praise and thanks, for it is his God-given spirit that prompts my efforts and his spirit that guides my search to the sought-after records, it was his spirit that moved upon men in past ages to make records of birth, marriages and deaths, and it was his spirit that prompted men and women to publish to the world the records made hundreds of years earlier. So what things are due me? None. All that I have found, all that I have recorded, all that I have presented in the Lord's House for saving ordinances has been done because my Heavenly Father blessed me with the spirit of Elijah (if I understand aright). Today, and for several days, at scattered opportunities of a few moments at a time, I have been gathering information for record of the Aldens of early American antiquity. It happens to be Aldens because that family is about the first in my alphabetically arranged genealogical record. Today is the 185th anniversary of the birth in Hopkinton, Massachusetts of my 3rd Great Grandfather, John Young. He died at Quincy, Illinois in 1839. The saints, seeking a haven of rest and refuge from their Missouri persecutors, who had driven them at the point of guns from their homes, causing many to perish from exposure and mobbings, or camping some of them, temporarily, at Quincy. Father Young was old and could not bear such ruthless, inhuman, unchristian-like treatment; and sank down in death, but Father Young shall stand upon the Earth again in the flesh no more to be driven, mobbed and persecuted but shall dwell in Eternal Life with his Father and his God in pure felicity. May I too enjoy the greatest of blessings given of God to his obedient children; that of Eternal Life."
    },
    {
        "date": "03-07-1948",
        "startPage": "49",
        "endPage": "51",
        "text": "When I return this fall from my proposed eastern tour I will have visited a total of 47 of the largest cities of the US (100,000 and over). They are: New York, Chicago, Philadelphia, Detroit, Los Angeles, Cleveland, Baltimore, St Louis, Boston, Washington DC, San Francisco, Milwaukee, Buffalo, New Orleans, Cincinnati, Newark, Kansas City, Seattle, Rochester, Denver, Louisville, Portland, Oakland, Jersey City, Memphis, Toledo, Providence, Omaha, Syracuse, Worcester, Richmond, Hartford, Grand Rapids, New Haven, Salt Lake City, Springfield, Bridgeport, Norfolk, Albany, Trenton, Kansas City, Kansas, Erie, Wilmington, Wichita, Sacramento, Cambridge, and Utica. The committee for members of the Adult Aaronic priesthood was recently reorganized. The new ward chairman is Bro. Devitt. I don't think he likes me as a class instructor. Last Sunday one of the committee members gave the lesson, today Bro. Devitt gave the lesson and he has assigned next Sunday's lesson to another member of the committee. After three or four Sundays I think I'll catch on. I'll return to my seventies quorum class room. A check with the calendar reveals an amusing and satisfying coincidence. My Saturday schedule brings me to work Saturday October 2nd with a Friday comp day. So that the traveling schedule I showed a few nights ago will be right. I can leave the city Thursday, October 7th and can be in Detroit Monday 11th when my vacation begins. Frank wants Ardie to buy a car and take it with her to Okinawa. She will be getting the money from him a port call almost any day now. She will probably want me to drive her to San Francisco."
    },
    {
        "date": "03-08-1948",
        "startPage": "51",
        "endPage": "51",
        "text": "My Saturday schedule, which is every third Saturday, works out just right for my proposed trip this fall. I work March 20, April 10th, May 1st, May 22, June 19th, July 10th, July 31, August 21, September 11th, and October 2. Now my \"comp\" days also come out just right; as shown I work Saturday October 2nd and have the following Friday off as my comp day which is the 8th; now, as I have previously stated, by trading Thursday the 7th with one of my friends working a day tour, he working that evening for me and I work his 6:30 a.m. To 3:00 p.m. tour for him, I could be ready to leave that evening. Ardie got some papers today, advising her that she will sail next month. I am too sleepy, as shown above, to write more tonight."
    },
    {
        "date": "03-09-1948",
        "startPage": "52",
        "endPage": "52",
        "text": "Today Will Holmes, in accord with a prior agreement, gave me the \"a\" of the a-b-c of singing. No voice test, just posture, diaphragm breathing, etc. It is interesting.\\n\\tSaturday A.M. I plan to spend in the library gathering from the Enfield Vital records the family of Major Amos Alden.\\n\\tVera Moore underwent a goiter operation yesterday morning. The one report we at the temple have had said she was doing okay. I must not forget her in my prayers for a few days.\\n\\tA new travel schedule I made today saves 2 days time between here and Boston.\\nLeave St Louis Thursday October 7th\\nArrive Denver Friday October 8th\\nLeave Denver Friday October 8th\\nArrive Burlington Saturday October 9th\\nLeave Burlington Saturday October 9th\\n\\tArrived Chicago Friday October 9th\\nLeave Chicago Sunday October 10th\\nArrive Detroit Sunday October 10th\\nLeave Detroit Monday October 11th\\nArrive Cleveland Monday October 11th\\nLeave Cleveland Monday October 11th\\nArrived Buffalo Monday October 11th\\nLeave Buffalo Tuesday October 12th\\nArrive Rochester Tuesday October 12th\\nLeave Rochester Wednesday October 13th\\nArrive Albany Wednesday 13th\\nLeave Albany Thursday 14th\\nArrive Boston Thursday 14th\\n\\tI leave Salt Lake Thursday P.M. and if I can keep the schedule I can be in Boston the following Thursday P.M."
    },
    {
        "date": "03-10-1948",
        "startPage": "53",
        "endPage": "53",
        "text": "The worst storm of the winter was raging this morning when I left for work. All day it has been cold and is still very cold tonight.\\n\\t220 days until I leave on my eastern tour."
    },
    {
        "date": "03-11-1948",
        "startPage": "53",
        "endPage": "54",
        "text": "Today I ran across a pedigree chart of Experience Wheeler Rudel, a sister to Betsy Wheeler Brownell, daughters of Randall and Experience Alden Wheeler. It shows that Randall's father was Samuel Wheeler and his mother was Lois Fairchild. The Wheeler ancestral lines are carried out about three generations farther but the Fairchild progenitors are not shown.\\n\\tThis Fairchild name I remember from some of Kenneth Larson's manuscripts, but I am not satisfied with the authenticity of either record, but at least it is something to check on."
    },
    {
        "date": "03-12-1948",
        "startPage": "54",
        "endPage": "54",
        "text": "I made an error in computing my schedule Saturday between now and October 1st. Following is the corrected schedule: March 20th, comp 26; April 10th, comp 16th; May 1st, comp 4th; May 22nd, 28; June 12th, comp 18th; July 3rd, comp 6th; July 24th, comp 30th; August 14th, comp 20th, September 4th, comp 7th; September 25th, comp October 1st. This moves my vacation ahead a week. Instead of leaving the city October 7th as planned, I will; (I mean I plan) to leave September 30th p.m. That is 28 weeks from yesterday.\\n\\tMy proposed vacation will cover October 4th to 22nd but in reality it will begin on the 1st and finish on 24th. 24 full days, and charged with 15.\\n\\tInstead of 220 days as I indicated last Wednesday it is only 195 before I leave on my tour of the east.\\n\\tI have fought sleep all afternoon so I am going to bed."
    },
    {
        "date": "03-13-1948",
        "startPage": "55",
        "endPage": "56",
        "text": "I did a lot of research today and did a lot of record making. Still on the Alden branch.\\n\\tIt's time I was hearing from some of the people I have written to recently, including the RMS clerk in Washington DC.\\n\\tFeels like spring has come. It is balmy tonight.\\n\\tFrom Washington DC to St Louis I have decided to ride the B&O in preference to the C&O. It runs across southern Maryland, across southern Ohio into Cincinnati. A side trip into Louisville, Ky goes without extra cost. From Cincinnati the route is nearly due west into St Louis. At St Louis, which is the western terminus of the B&O, I ride the Santa Fe into Denver.\\n\\tThe D&RG to Denver; the CB&Q to Chicago; the NYC to Boston; the NYNH&H to New York; the Penn. to Washington DC; the B&O to St Louis; the AT&SF to Denver and the D&RG back to Salt Lake. All for only $115. From Chicago to Milwaukee and return; from Albany to Rutland and return; from Boston to Portland and return; from Washington DC to Savannah and return; from St Louis to New Orleans and return and from New Orleans to Pensacola and return, all for only $65. Renting a car in Burlington, Iowa; renting a car at Rochester, New York; and renting a car at New Haven for a day at each place, for $30. Plus $115 for hotel and eating expenses makes a grand total of $325. For this money I can travel as far east as Boston, as far north as Maine, as far as South as Florida; from Portland Maine to Pensacola, Florida; and from Detroit to New Orleans.\\n\\tIt would be interesting to have half a dozen glass vials of sand taken from the shore of one of the Great Lakes, from the Atlantic, from the Gulf of Mexico, from the Pacific, also some salt from Utah's inland sea."
    },
    {
        "date": "03-14-1948",
        "startPage": "56",
        "endPage": "57",
        "text": "I got Charles up this morning in time for priesthood meeting. He was ready to go at 9:00, but instead he, presumably, went to the home of one of his delinquent friends. I don't know what is going to happen to him. I understand that he is only an example, of together with his brothers and sisters, of what I divided home produces.\\n\\tI would like to give Charles and Cathy a better break than this hellish home affords. If my plans materialize I will make a new home far away for us there."
    },
    {
        "date": "03-15-1948",
        "startPage": "57",
        "endPage": "58",
        "text": "Grace and I had another bitter quarrel last evening. I vow it was the last. So help me I'll not quarrel again no matter how badly I am provoked, no matter how badly I am upset. We'll see if by controlling my temper and keeping quiet when she gets angry, will prevent a flare-up.\\n\\tWell, I can trade into the Troy office. A letter in the clerk's box when I went to work today. Mr Warren E. Springer who resides at #40 5th Ave. Troy wants to get into a high locality on account of his wife's health. He is 41 years old, has one child, is a $3100 grade clerk. I shall write him a letter at once telling him the things he wishes to know about S.L.C.\\n\\tTroy, New York is quite ideal I think for me. It is close to nearly every point I want to visit, but most of all it is only an hour or so from Hartford. The Connecticut State Library is the place that interests me most. Troy is about 100 miles north of NYC on the Hudson River. It is about 5 miles from Albany the State capital. It is about 30 to 40 miles from Pittsfield, Massachusetts, about 40 miles from Hinsdale, Massachusetts, Waterford and Lansingburgh are very close. The former lies across the river in Saratoga County and Lansingburgh is a suburb of Troy, lying up the river three or four miles. It is only about 100 to 150 miles from Fairfield, Connecticut and about the same from New London and Lyme."
    },
    {
        "date": "03-16-1948",
        "startPage": "58",
        "endPage": "59",
        "text": "A letter was in the clerk's box at the P.O. today from Mr Kutz at Rochester who seems now, instead of wanting a three-way trade - he into Northern Penna, another clerk to SLC and I to Rochester - to want to come to SL but the Troy trade offer from Mr Springer looks good, better than the Rochester deal. Of course there is the possibility that when Mr Springer learns that he will have to work an owl tour for a year or thereabouts maybe he won't be so keen about trading. I don't know why the RMS clerk in Washington DC hasn't answered my letter.\\n\\tA letter received yesterday from the Greyhound Lines at New Orleans advises that the round trip fare from there to Pensacola would be $7.76."
    },
    {
        "date": "03-17-1948",
        "startPage": "59",
        "endPage": "61",
        "text": "Today; nineteen years after my Heavenly Father, in answer to fervent prayer, delivered me from the enslavement of cigarettes, I give thanks to him and praise him for the countless additional blessings he has given me since that day.\\n\\tI'm grateful indeed tonight that I can honestly say that I have not touched the filthy things from that day to this. I am most appreciative that the stuff, to me is abominable, I hate it, I detest it. I believe it is a weed of Satan, intended to enslave the world; and it has just about done it.\\n\\tThanks again, father, for so abundantly blessing me 19 years ago, taking from me the craving, which I had many times attempted and as many times failed to overcome.\\n\\tI will never forget how happy and how proud I was when I learned that my heavenly father had, that Sabbath day purged my body or my spirit, whichever part of the individual it is that becomes enslaved. I felt impelled to jump and shout for joy.\\n\\tI think my heavenly father from the bottom of my heart for giving me of his holy spirit so abundantly that the evil things like tobacco and liquor, are no temptation to me. Coffee I can honestly say never did have attractions for me. I drink it for some years but left it alone without the least trouble. I never did drink but very little tea, but being part English I like it but have no difficulty in leaving it alone.\\n\\tI am too sleepy to attempt to write more tonight."
    },
    {
        "date": "03-18-1948",
        "startPage": "61",
        "endPage": "61",
        "text": "One of these days I'll have to have my teeth extracted. Most of them are badly decayed. I think, in fact I am sure, that the bad teeth is the cause of the aching left shoulder and upper arm."
    },
    {
        "date": "03-19-1948",
        "startPage": "61",
        "endPage": "62",
        "text": "Winter returned today in an equinox storm. About 4 inches of wet, heavy snow fell this P.M.\\n\\tHenry A. Wallace, a Communist, a traitor to his country and is a presidential candidate. There are thousands of communists in America, but their strength will not be known until this fall when a general election takes place. Of Wallace I have said a number of times, \"in the old days\" we shot traitors now we let them run for the highest office in the nation, which goes to show how far the American people have declined in their thinking, in their standards and their morals. America has become a haven for European isms. We have become corrupt, depraved, and devilish. The lofty ideas of the pilgrims, the early colonists, and founders of our once Christian Commonwealth have fallen into gradual decay.\\n\\tIt is late and I am very sleepy. And anyway who cares what I think about the political and economic state of the US?"
    },
    {
        "date": "03-20-1948",
        "startPage": "62",
        "endPage": "63",
        "text": "Being on the sick list today I didn't report for my scheduled Saturday assignment. I caught a cold yesterday P.M. Which naturally grew worse as the evening wore on. I am weak, achy and I have a temperature tonight. Hope I don't get the ailment the little kids have had. Frank and Barbara have been very sick, vomiting and dysentery. Last night Cathy came down with the same ailment. She is running a temperature."
    },
    {
        "date": "03-21-1948",
        "startPage": "63",
        "endPage": "63",
        "text": "Before I leave on my proposed eastern tour, I want to get a dozen or more plastic bottles or vases that can be closed with a screw lid. When I get into a beach city like Chicago, Milwaukee, Detroit, Cleveland, Buffalo, Rochester (which is a few miles inland from shore of Lake Ontario), Boston, Portland, Providence, New Haven, Bridgeport, New London (if I stop in New London), New York, Savannah, New Orleans, Pensacola. Such a collection should be well worth the effort to get them together."
    },
    {
        "date": "03-22-1948",
        "startPage": "63",
        "endPage": "65",
        "text": "What I started to say yesterday was I would take sand from each of these beaches and put into a vase then label it.\\n\\tSunny shows symptoms this evening of the same ailment the little children have had.\\n\\tVera Moore is home from the hospital but won't be back to work for another week or 10 days.\\n\\tConsulting the Pennsylvania RR and B&O RR time tables this evening I have decided to ride the B&O from New York to Washington DC and on to St Louis. Between New York City and Washington DC the two roads must run parallel. They serve the same interlying cities.\\n\\tToday Sharon turned 18, but she has left her home, I haven't seen her in months. She comes home occasionally during the day while I am at work.\\n\\tBetty left home over a year ago, Sharon has left home. Why? They, like I, dislike the oft-found bitter spirit in the home. This bitterness is caused by division between father and mother. One might ask, why is there division between father and mother? Well, the best way I know to answer that question is this when husband and wife have conflicting ideals, conflicting desires, conflicting ambitions and conflicting religious tenets; there will be found a house divided against itself; which Jesus has said \"cannot stand\".\\n\\tWhen I heard Jean Linton tell, this morning, how her father and mother remodeled their home I said to myself what they can do I can do. It would be ridiculous for me to expect my wife to pitch in and help me, nevertheless I would pitch in tomorrow if only I could buy the materials necessary to complete the remodeling job."
    },
    {
        "date": "03-23-1948",
        "startPage": "65",
        "endPage": "65",
        "text": "I am much too sleepy and weary to attempt to put anything into my journal tonight."
    },
    {
        "date": "03-25-1948",
        "startPage": "65",
        "endPage": "66",
        "text": "I came home sick last night, had to get off the bus at 7th South and 11th East and vomit. So I let the journal slip.\\n\\tAnother letter came today from Mr Springer of Troy. The trade looks pretty good though probably not at once. This is OK by me. I wouldn't care if he was willing to wait until I was free from debt.\\n\\tWe have a new supervisor in the archive, brother Kay Kirkham. Harold Dent has gone back upstairs and reopened his old assignment of coordinator between the society and the temples.\\n\\tTwenty six weeks from today I hope to be on my way east, whether to work or for vacation trip."
    },
    {
        "date": "03-26-1948",
        "startPage": "66",
        "endPage": "67",
        "text": "The Santa Fe timetable shows that I can ride either the Missouri Pacific or the Chicago, Rock Island and Pacific between St Louis and Kansas City; I think the Rock Island is the crack road of the middle west so I guess I'll ride it.\\n\\tThe railroads over which I plan to ride are Rio Grande, Burlington, New York Central, New Haven, B&Q, Rock Island, Santa Fe and Rio Grande. Seven railroads; the Rio Grande from St Louis to Denver, the Burlington, Denver to Chicago, the New York Central, Chicago to Boston, the new Haven, Boston to New York, the B&O, New York to St Louis, The Rock Island, St Louis to Kansas City, the Santa Fe, Kansas City to Denver and the Rio Grande, Denver back to Salt Lake.\\n\\tIf only my heavenly father would permit me to make this trip."
    },
    {
        "date": "03-28-1948",
        "startPage": "67",
        "endPage": "67",
        "text": "Sonny and I attended the morning session of our Sugarhouse Stake conference this morning. I enjoyed having him along, and of his free will and choice too.\\n\\tIt is a glorious Easter Sunday, bright and sunny and warm. 1915 years have gone since Jesus of Nazareth, the Redeemer of the world rose from the dead and became the first fruits of the resurrection."
    },
    {
        "date": "03-29-1948",
        "startPage": "67",
        "endPage": "69",
        "text": "We had another bitter quarrel last night, again I resolved to press Mr Springer for an early trade instead of waiting until fall. These raging outbursts are followed by days of silence where neither one speaks to the other. Sounds silly and childish, but she will not speak and if I speak I either am ignored or I get a hateful reply.\\n\\tI am not going to continue to live like this. I don't know exactly what I am going to do about it but I am going to do something and soon. I can't live much longer under such hellish conditions. Six months is a long time to wait, quarreling once a week.\\n\\tOne might say why do you quarrel? When two people who have opposite views on everything have to live together must disagree on nearly every topic of conversation. Last night I was accused again, for the hundredth time of seeing the woman I had an affair with which affair ended over a year ago, and this woman I haven't seen except to pass her on the sidewalk a few times since. But as long as there is an angry breath left in Grace's body, she will accuse me of infidelity, adultery, a dirty G. d. Mormon, etc. That my mother is as bad as I. Now, how long must a person tolerate such abuse and such insults? I don't know what your answer would be, but I know that I am not going to tolerate it indefinitely.\\n\\tSeems to me Sonny is getting worse of late. Hope I am mistaken.\\n\\tAttended morning and evening sessions of our Stake conference yesterday in the Bryan ward chapel. Elder Ezra J Benson of the Quorum of Twelve was the visiting general authority. Next Sunday is general conference. Sunday, Monday and Tuesday."
    },
    {
        "date": "04-05-1948",
        "startPage": "69",
        "endPage": "70",
        "text": "Several days have gone by since the last entry was made in my journal.\\n\\tAbout two weeks ago at the invitation of Professor Will Holmes, cashier and paymaster of the Genealogical Society, I am receiving vocal instruction and training, two periods each week. Will wants a male chorus all individually trained by himself. It is very interesting and I enjoy the ABCs I have been and am being taught.\\n\\tGeneral Conference, the 118th began yesterday and will continue through tomorrow.\\n\\tI'm terribly sleepy tonight. Can't stay awake any longer."
    },
    {
        "date": "04-06-1948",
        "startPage": "70",
        "endPage": "72",
        "text": "The Church of Jesus Christ of Latter-day Saints was organized by Divine command 118 years ago today at the home of Peter Whitmer in Fayette, Seneca County New York, with six members who had previously been baptized.\\n\\tThe Prophet Joseph Smith, whom the Lord had chosen for this great important responsibility; of re-establishing the Church of Jesus Christ upon the Earth; was at that time in his 25th year. He had been tutored by the almighty for the space of 10 years, and seen God, the Eternal Father and his son Jesus Christ when they personally appeared to him in the sacred grove during the early days of the spring of 1820. 3 Years later a Heavenly messenger who introduced himself as Moroni, an angel sent from the presence of God, visited the lad in his bedroom when his parents resided on a farm near Manchester, New York. 4 years from that day he received from the Angel Moroni the gold plates which the same angel had deposited and hidden away 1,400 years earlier, or about 400 AD. The plates were translated by him through the gift and power of God and aid of the Urim and Thummim.\\n\\tA member of divine revelations had been given the young prophet prior to the date mentioned in the opening of tonight's treatise. From one of the later sections of the book called \"the Doctrine and Covenants\" I shall quote a few lines to show how closely this young man lived to his God and how his Lord spoke to him either by his voice or by inspiration and revelation, during many years."
    },
    {
        "date": "04-07-1948",
        "startPage": "72",
        "endPage": "73",
        "text": "The theme of last night was closed incomplete because I couldn't find my Doctrine and Covenants, from which I was going to quote.\\n\\tArdis' port call came a few days ago. She has to be in San Francisco on the 21st. Her boat sales on the 24th, that's 2 weeks from next Saturday. It is going to be darn lonesome here when Ardie and her two babies leave.\\n\\tThe 118th General Conference came to a close yesterday. I did not attend any of the sessions though I did listen to lots of it on the radio. The most valuable council to me came from president Clark about putting our homes in order, which the Lord helping me, I aim to attempt to do. I want to get the sermons of this conference as soon as they are compiled and printed.\\n\\tMaybe we will have a new roof on our house in the near future. A man was here this morning, gave us an estimate and said they would begin in a few days. It will cost us $307 payable $10 per month, beginning in June. It would take two and a half to three years to pay it off."
    },
    {
        "date": "04-08-1948",
        "startPage": "73",
        "endPage": "73",
        "text": "I haven't felt very good today so I'm going to go right to bed. Whatever I intended to write about tonight can wait until tomorrow night."
    },
    {
        "date": "04-16-1948",
        "startPage": "73",
        "endPage": "74",
        "text": "For some unexplainable reason the old journal has been neglected of late. More than a week has gone by since I last wrote a line here.\\n\\tSince the last entry our house has had a new roof put on and now a new paint job is needed more than ever.\\n\\tI have been shopping today for money to remodel the kitchen and bath, to the tune of $700 payable at $22 per month plus the $10 per month for the new roof makes a total of $32 per month for about three years. How I am going to pay out so much money each month and still lay away $300 for an eastern tour I don't know. The $40 we have been getting from Ardis we won't be getting anymore, instead we will have to pay out money to someone to have Cathy tended each day.\\n\\tArdie and her two children leave next Monday evening at 11:55. Mama is going with them to help tend the kids during the four days they are in San Francisco waiting for the sailing date of the Okinawa boat. Grace will be gone about a week.\\n\\t24 Weeks from last Thursday I hope to leave on my touring vacation into the east, taking me into Colorado, Nebraska, Iowa, Illinois, Wisconsin, Indiana, Michigan, Ohio, Pennsylvania, New York, Vermont, Massachusetts, New Hampshire, Maine, Rhode Island, Connecticut, New Jersey, Delaware, Maryland, Virginia, North Carolina, South Carolina, Georgia, West Virginia, Kentucky, Missouri, Tennessee, Mississippi, Louisiana, Alabama, Florida, Arkansas, Kansas, Oklahoma, Texas, and New Mexico. Add to these Idaho, Montana, Wyoming, Nevada, California, Arizona and if I can get up to the northwest this spring or summer that would add Oregon and Washington to the long list of states visited."
    },
    {
        "date": "04-17-1948",
        "startPage": "75",
        "endPage": "76",
        "text": "May our heavenly father open the way or prepare the way for us to get the $700 to remodel our kitchen and bath and take out the old style colonade between the living and dining rooms. It would make such a difference in our home. I know, Father, that my credit rating isn't the best, but I am trying hard to make it as good as any man's rating in this city. I pledge to thee, my Father, that if you will help us obtain this remodeling loan I will try harder than I have ever tried before to be obedient and to be of service in thy Church. Please help us our Father to both obtain the loan and faithfully repay it. I ask in my Redeemer's name: Amen.\\n\\tLast Sunday Dot and Bryce brought Craig to fast meeting and I was ??? In giving him a father's blessing and the name Preston Craig Olson. Sally Wells, now Mrs Williams came also with her baby and I was asked to bless her also. They had us give her the name Sandra Jo Williams."
    },
    {
        "date": "04-18-1948",
        "startPage": "76",
        "endPage": "77",
        "text": "I attended Quorum meeting and Sunday school this morning, took Charles along with me.\\n\\tGrandma Petersen came out today, spent the afternoon and took dinner with us. She Looks poorly and matter of fact is quite poorly. Her health is failing quite fast. She does not want to die, because of her daughter, Leah. I think she, like most all of us, has a horror of death. It is an experience we know we must all press through yet we seem to want to keep that dreaded experience ever and ever in the dim, undetermined future.\\n\\tI have been taking Cathy and sometimes Frank to Sunday picture shows, but as of this date, the Lord being my keeper, for I am weak, I shall not do it anymore.\\n\\tGrace and Ardie and the two little kids leave tomorrow night for San Francisco. It will be a lonesome week again this Sabbath eve I implore thee, my heavenly father to influence the Judgment of the men who might allow us the $700 loan with which I plan to remodel our kitchen and bathroom. And again my father, if it isn't asking too much will you please prepare the way and the means so that thy servant can take little Cathy on an extended trip east this fall."
    },
    {
        "date": "04-19-1948",
        "startPage": "77",
        "endPage": "78",
        "text": "Last Saturday was the 18th birthday of this journal. Many lines and many words have been written since that day long ago. Many important and many less important events will be found in the pages of my journal; also many gospel themes opened up, few however are properly treated and properly closed.\\n\\tThis morning Ardie got a wire from Frank which read \"stay in Salt Lake City.\" so her train ticket, her boat trip, her baggage removal and all were canceled. Then this evening a second wire was received which read \"Ignore first wire, and come on.\" What does the idiot think we are anyway. Today was her departure day, she was to leave SLC this evening so as to be in SF on the 20th.\\n\\tI would get some free army legal aid and sue him for divorce and ask for $250 per month support money for she and the two children. And tell him to go to hell and never show his face again. The fool. He went berserk because Ardie asked him for $100 additional money for Grace's expenses to the coast to keep Ardie with the two little kids. I think it was wrong for her to ask for more money in view of the $1,100 she had already received, maybe he doesn't think he owes Grace and I anything."
    },
    {
        "date": "04-20-1948",
        "startPage": "78",
        "endPage": "80",
        "text": "I advised Ardie to answer her would-be husband's insane act with a writ from her attorney, announcing her intentions for divorce. Even though she went to him in 30 days he would pull some unpredictable, insane stunt that would drive her away from him. She would have to seek safety off the island. He is unsafe and unreliable and an unfit husband and father. Better she should be rid of him now then to wait until she has three children on her hands to care for. Once he is out of the army she will never get another penny from him.\\n\\tThe other day I picked up a Rock Island Railroad timetable that shows only one train per day operating between St Louis and Kansas City. It is 300 miles and takes 9 1/2 hours. It is a daylight ride, leaving St Louis at 8:30 a.m. and arriving at Kansas City at 6:00 p.m.\\n\\tThe Missouri Pacific covers the entire distance from St Louis to Denver and instead of riding the Rock Island and Santa Fe I might ride the MP. It would cost me a little more for a bus trip South into Texas if I rode the MP because the MP rails are north of the Santa Fe.\\n\\tAt present the proposed trip will be as follows: Salt Lake to Denver - the Denver and Rio Grande; Denver to Chicago - the Burlington ( CB&Q); Chicago to Boston - the New York Central; Boston to New York - the New York New Haven and Hartford; New York to St Louis - the B&O; St Louis to Denver - the MP and from Denver to Salt Lake the D&RG.   Credit travel cards good on nearly all of the lines I will be traveling can be secured if the applicant is good credit rating. This would enable me to secure a round trip ticket and pay for it say within 60 days after I return."
    },
    {
        "date": "04-21-1948",
        "startPage": "80",
        "endPage": "81",
        "text": "A review of the return trip from New York shows that by taking the Rock Island at KC to Tucumcari, New Mexico thence north into Pueblo, Colorado and Denver I could travel into Oklahoma, Texas and New Mexico for perhaps six or seven dollars additional money, maybe less. From Tucumcari I would return to Dalhart, there I board the Fort Worth and Denver city train.\\n\\tSome years ago I worked with Ed Wallace, who became a very good friend. He told me so much about his years of railroading in Dalhart, Texas and Tucumcari, New Mexico that I wanted to see the towns. For $2 extra fair I can ride the Golden State streamliner from Kansas City to Tucumcari over the Rock Island route a distance of 614 miles in 11 hours. I would arrive in Tucumcari at 7:45 p.m. And could get a train in about an hour which would get me back to Dalhart that night at 10:30 and the following morning I would board the Colorado and Southern for Denver, arriving in Denver that evening.\\n\\tHow to find how much extra it will cost me to travel from Kansas City to Denver via Tucumcari, New Mexico. Shouldn't be more than $6 and the $2 for extra fare to ride the fast streamliner would be only $8."
    },
    {
        "date": "04-23-1948",
        "startPage": "81",
        "endPage": "82",
        "text": "The side trip from Kansas City to Tucumcari via Dalhart over the Rock Island will cost too much. The railroad companies make no concessions for out of the way routes. Instead they charge straight fare (one way) from Kansas City to Tucumcari and from Tucumcari back to Dalhart and thence north to Denver. The extra routing would cost me near $40 so that's out. Instead I'll try to arrange a bus tour south from Garden City Kansas to Dalhart thence west to Tucumcari and return to Garden City. This shouldn't cost me more than $10. I'll stop in at the bus depot one of these first days and get the fare and service I have mentioned."
    },
    {
        "date": "04-25-1948",
        "startPage": "82",
        "endPage": "83",
        "text": "With this new roof I have saddled myself with an additional $10 per month debt for 3 years. The thing that has kept me wondering of late is: could I pay my monthly obligations; $12.50 to Credit Union, $10 to Welby Johnson, $5 to Mutual Loan, $10 to Cont Bank (for new roof) $2.50 to Buckley; $2.50 to Rock wool, $2.50 to Jensen's Jewelers and $5 to wards (for 2 years). A total of $57.50, which does not include the $22 for this new loan nor $57 monthly payment on the home; and live in the east. My home is daily becoming more and more unbearable. Sooner or later, and the sooner the better, I will transfer east. I could transfer tomorrow to R. But I would rather go to J. Grace has told me that I haven't guts enough to go, that if I went I would come crawling back."
    },
    {
        "date": "04-29-1948",
        "startPage": "83",
        "endPage": "84",
        "text": "Since Sunday we have been reconciled again. I do hope and pray that this time it will last. I vow I will do my best, I'll try to keep my temper under control when she gets mad. With the reconciliation comes the remodeling job and it's $805 cost. This I don't mind. I don't mind anything about costs if only Grace and I can get along.\\n\\tThe $350 tour expense I am sure I can raise. I might have to borrow part of it though. I hope that Grace will let Cathy go with me. The only cost of taking her along would be her food. Her transportation would cost nothing by train or by bus, by subtracting a few months from her age. Up to 5 years children are carried free."
    },
    {
        "date": "05-02-1948",
        "startPage": "84",
        "endPage": "85",
        "text": "These past two days have been cold, cold enough to freeze at night. A frost now would catch almost all fruit trees in bloom.\\n\\tAttended Sunday school and fast meeting this a.m. as well as priesthood meeting.\\n\\tI have a special assignment to work today.\\n\\tWe discussed in Our Gospel Doctrine class, this morning, a phase of Book of Mormon history and geography, that interested me. I have this observation to make: there are extant many theories published by reputable students of the Book of Mormon, about the geography and topography of that part of South America supposed to have been the locale of the Nephite, Mulekite and Jaredite nations, but in my humble opinion none of these published maps, etc can be authentic because, as I understand it, the face of the entire land was changed during those three dark, terrible days while the Lord lay in the tomb (\"all creation was pained\") in addition to the geographical changes there were also topographical changes. The contour of these two continents, I think, were changed and removed and probably do not appear at all today as they did in the days of the pre-christian Nephites."
    },
    {
        "date": "05-08-1948",
        "startPage": "85",
        "endPage": "86",
        "text": "Seems I'm having trouble getting around to making an entry that goes farther than the date.\\n\\tMama and Cathy and I went shopping today at Sears. What a great store Sears is since they moved into their newly built, huge, modern store, located at 754 South State. It reaches through the block from Main to State and about halfway to 7th south from 8th South with large parking space south of the store. Thousands of people were there shopping. We plan to buy our kitchen repair items there; like the new sink with fittings, wallpaper for two front rooms and our bedroom, paint for the kitchen and front rooms.\\n\\tWe have postponed remodeling the bathroom after a while. A built-in tub, a pedestal basin, tile to the wainscot, taking out the partition between the bath and toilet rooms and building a clothes closet along the west side of our bedroom would cost us, with the plumber's bill, about $350. I aim to do this job myself within the coming 2 years, for a lot less than $350."
    },
    {
        "date": "05-09-1948",
        "startPage": "86",
        "endPage": "88",
        "text": "I went downtown early this morning to meet Will Holmes. He spent nearly 2 hours giving me a voice lesson. I am just beginning to show, finally, some signs of improvement.\\n\\tWhen we get our kitchen remodeled and painted; when we get the two front rooms papered and painted, Venetian blinds installed, new furniture and finally the bathroom modernized and beautified we will have a very beautiful home. But I am not sure that it will be any better place in which to live. Probably will not.\\n\\tThe payments on the home are $57 per month. The payments on the FHA loan for the new roof is $10 per month. The payment on the FHA loan for remodeling will be $23 per month. I am paying the credit union $12.50 per month, the American Investment Company $10 per month, the mutual loan company $5 per month making a total of $118 per month which I will pay from my Archive check and one P.O. check each month. In addition to this my tithing payments are $32 per month. A total of $140 out lay. In another city I would, of necessity have to get a part-time job for at least 3 years while I paid off my creditors. If I could earn $100 at part-time employment I could meet my SLC obligations each month and pay my way there OK. I think I could get a small two-room apartment for say $50 per month. My eats shouldn't cost more than $30 per month. My PO pay would be about $250 per month plus $100 for part-time employment making $350 per month. Of this amount $118 would have to be sent to Salt Lake to pay on debts and defray living expenses of my family. My own living expenses would be say $150 plus $35 tithing. Leaving me about $25 to spend or save.\\n\\tAt the end of 3 years, however, my debts would be reduced to $57 per month, the payment on this home. It will take eight more years to pay off this home.\\n\\tThe impossible conditions under this roof make it imperative that I sooner or later, make a change i.e. go away to some far distance city and state. After I got settled I would send Charles a bus ticket."
    },
    {
        "date": "05-10-1948",
        "startPage": "88",
        "endPage": "90",
        "text": "Word has been received from Betty announcing her marriage to Mr Windham in Memphis or near Memphis on her 24th birthday, May 1st. I wish you two much happiness. I hope you never have a first quarrel.\\n\\tI am attaching another candid camera shot of Grace and I taken, I think, a week ago Friday.\\n\\tFollowing is a three stanza poem which having been set to music, is called long, long ago. This song Professor Holmes wants me to memorize and remember all my life.\\n1\\nTell me the Tails\\nthat to me were so dear\\nLong, long ago;\\nSing me the song\\nI delighted to hear\\nLong, long ago; you are come\\nall my grief is removed\\nlet me believe that you love\\nAs You Loved\\nlong come a long ago;\\n2\\nDo you remember\\nThe path where we met\\nlong, long ago;\\nah yes you told me\\nYou ne'er would forget\\nlong, long ago,\\nthen to all others my smile\\nLove, when you spoke\\nGive a charm to each word\\nstill my heart treasures\\nthe praises I heard\\nlong, long ago,\\n3\\nTho by your kindness\\nMy fond hopes were raised\\nLong, long ago;\\nYou by more eloquent lips\\nHave been praised\\nLong, long ago;\\nBut by long absence\\nYour truth has been tried\\nStill to your accents\\nI listen with pride\\nBlest as I was\\nAs I sat by your side\\nLong, long ago;\\nI have the first two partially hammered into my thick skull I am working on the third."
    },
    {
        "date": "05-11-1948",
        "startPage": "90",
        "endPage": "90",
        "text": "I have almost abandoned my eastern tour. Instead I think I'll put the equivalent in money into storage food. I am sure it would be if far wiser thing to do, especially in view of unstable world economy and black war clouds which have been gathering since hostilities ceased. I am too sleepy to write more tonight."
    },
    {
        "date": "05-12-1948",
        "startPage": "90",
        "endPage": "91",
        "text": "It is strange how the Lord, in answer to prayer brings things about. Quite some time ago I asked my heavenly father to please open the way for me to go east this fall but if I was asking for something that wasn't good for me or something that wasn't right, then would he please remove this traveling obsession from me. Through one of his servants, a fellow workman of mine, he told me what he wanted me to do instead. He wants me to spend an equal amount for storable food stuff against a close-approaching famine or food shortage. When, due either to conditions of the elements or labor trouble or war, we will be unable to buy the things to keep the body sustained, which today are plentiful."
    },
    {
        "date": "05-15-1948",
        "startPage": "91",
        "endPage": "92",
        "text": "I worked nearly all day on the yard. Hauled soil and filled up two large low places in front lawn. Grace set out some seedlings and some potted plants. In a week or two the front yard should look much better.\\n\\tA carpenter will be here this coming week to tear out the colonnade and floor the exposed places. Instead of arching the opening we are going to frame it or finish framing it. It will look just as nice and will cost much less.\\n\\tCan I pay $32 per month on FHA Loans, pay the collectors of internal revenue and the State Tax Commission $200, lay away a case (or equivalent in cost) of canned foods each payday and still hope to go east this fall? If I go it will have to be next spring, say in May 1949. I could lay away $200 by that time and borrow $150 to make the stipulated amount."
    },
    {
        "date": "05-18-1948",
        "startPage": "92",
        "endPage": "92",
        "text": "It is late and I am sleepy, having painted for 2 hours this morning before I went to work. It has been uncommonly warm these past 2 days, for this month. It will probably rain tonight or tomorrow."
    },
    {
        "date": "05-23-1948",
        "startPage": "92",
        "endPage": "94",
        "text": "I met my voice instructor this morning at 7:45 and we worked until 9:00. Then I spent 2 hours on my genealogical records. These past two Saturdays I have worked, May 1st and yesterday, May 22nd I have worked the following Sundays, due to a temporary condition in the city section.\\n\\tIn my genealogical records I am discovering many heretofore unknown important bits of information in many entirely new families. Today I came to one of the daughters of great-grandfather Ellsworth's daughters; Alice Vilate who married James O Swift. I have heard this man's name mentioned in my father's home several times, but today I know almost nothing about him. He was a native of South Africa, was born 1849 baptized 1857 and endowed 1870. What happened to him? where did he and his wife reside? Did they have children? These are some of the questions I hope to be able to answer if only I could learn the true parents of James Dennison Colt. I long since joined him to the family of Benjamin Colt of Lyme, but I have absolutely no evidence to substantiate this connection. I found no other family in Lyme who could have had a child born 1740, but that is not evidence, only guessing."
    },
    {
        "date": "05-24-1948",
        "startPage": "94",
        "endPage": "95",
        "text": "During a brief moment today which I spent on my records I came upon the marriage of Alice Vilate Ellsworth, my great aunt, to James Owen Swift, a native of South Africa. Then tonight my cousin Alavon called to see me at the office. During our conversation I asked her about the children of this couple and she told me there was an Owen, a Wm and an Alice. I remember, faintly, Aunt Allie Wilson and her daughter Dot Wilson. They lived in Lewisville many years ago. Aunt Allie is now dead and Dot must be a woman close to 60. She lives somewhere in California I think Alavon said.\\n\\tJames O Swift was a member of the church, was endowed 12th December 1870 in the endowment house and his wife was sealed to him that day by Elder Joseph T Smith, then an apostle.\\n\\tIt is so sweet of Alavon to call and see me each time she comes to town. She is a peach of a girl. She has her father's kind disposition. Her face was constantly wreathed in a smile.\\n\\tArdie is going to go to Frank. She will leave on June 5th. I hate to see her go. I don't trust either one of them together. Ardie has a very bad temper and Frank behaves like a badly spoiled boy at times. I do hope they can get along and make a success of their marriage."
    },
    {
        "date": "05-25-1948",
        "startPage": "95",
        "endPage": "96",
        "text": "The vacation schedule came to me the other day and I selected the first three weeks in October, but one of the weeks can be reserved for emergencies. By present schedule, set up for a year in advance, I will be scheduled to work Saturday September 25th, for which I would get Friday, October 1st as a comp day. Now if I work Sunday the 26th as well, I would get Thursday the 30th as a comp day. If I had worked Monday September 16th, Labor Day, I could select Wednesday the 20th as a comp. This would give me Wednesday, Thursday, Friday, Saturday and Sunday off and my vacation would begin Monday October 4th. Swapping tours on Tuesday the 28th of September with a friend on the day shift, I could be through at 3:00 p.m. on Tuesday and could get away that evening. Now my problem is getting the money (about $300) to finance the trip between now and late September.\\n\\tPlease, Heavenly Father, will you provide me with the means to take this eastern trip this fall; I pray humbly in Jesus's name: Amen.\\n\\tThe above plan would give me from 3:00 p.m. September 28th to 3:00 p.m. Sunday October 17th. A total of 20 days with only ten charged against my annual leave."
    },
    {
        "date": "05-28-1948",
        "startPage": "96",
        "endPage": "96",
        "text": "I painted today until nearly 3:00. Then I went down and worked a few hours at the Archive. Now I am asleep."
    },
    {
        "date": "05-29-1948",
        "startPage": "97",
        "endPage": "99",
        "text": "We all worked around the place today like Trojans. Mama did her weekly washing then worked in the backyard. Ardie cut the lawn with our new mower then watered the lawn. I painted and hung the new screen door then went down to the Archive and worked a few hours.\\n\\tAfter 2 days of painting I still haven't gotten the first coat on the woodwork in the front rooms. Windows and bookcases take the time.\\n\\tA most important question has been turning over and over in my mind of late. It is this: the vicarious work we do for the dead (and the temple ordinances the living perform for themselves) i.e. baptism, endowment and sealing of wives to husbands and children to parents, are ordinances which pertain to the Celestial Kingdom only; and since, so far as we are concerned, there is no Celestial Kingdom until after the resurrection and the final judgment hence these sacred ordinances are of no avail to anyone until after the resurrection when this Earth shall have passed through its paradisical glory and shall become a Celestial world for The Heirs of that Kingdom who had dwelled here in mortality.\\n\\tNow this is not, I am sure, generally accepted throughout the church, but nevertheless is fundamentally and logically true. No one I dare say who has died since the restoration of the Gospel in 1820 to 1830 has been raised from the dead.\\n\\tIt is true, let me add, that the spirits of those who have died prior to the Advent of the restored gospel, have heard it preached and taught and millions have accepted it and have repented and dwell in joy and happiness, looking forward, as do we in mortality, to that glorious day when our bodies shall be raised to incorruption and we may dwell in far greater and unbounded Joy than ever, and that our bodies are now Eternal and we having forsaken all of our evil doing are now capable and fit to dwell, as it were, in the presence of God; but there awaits the faithful of the Church of Christ as far, far, Greater Joy than dwelling in the presence of God - Which is far beyond our feeble ability to comprehend - that of becoming gods, of creating worlds and peopling them even as our heavenly father is doing with this Earth.\\n\\tAnd this is the purpose of the ordinances of the house of the Lord."
    },
    {
        "date": "06-01-1948",
        "startPage": "99",
        "endPage": "99",
        "text": "Following a terrible row last night I sent a wire today to Louis Kutz in Rochester telling him I was willing to trade offices with him. I told Charles last night that I wanted to take him with me to which he agreed."
    },
    {
        "date": "06-02-1948",
        "startPage": "99",
        "endPage": "100",
        "text": "It has been exceptionally quiet about the place since the free for all Monday night. Though this squall blows over, and it will, another is sure to come later on and in as much as each is more vicious and more hateful than the former I say in soberness, we should stop now lest something dreadful happen. After I have been needled and needled I can hardly control my fists. I have been socked a few times and that would ordinarily make a man mad enough to sock his grandmother.\\n\\tI am too sleepy to do anymore writing tonight."
    },
    {
        "date": "06-03-1948",
        "startPage": "100",
        "endPage": "100",
        "text": "The other night during our free-for-all I had my suspicions confirmed about my wife smoking. She has cigarettes ditched in the house all the time and smokes in the evening when she gets home from work. There is another reason why I should take the two younger children away from this evil home and give them a fresh start elsewhere."
    },
    {
        "date": "06-05-1948",
        "startPage": "100",
        "endPage": "101",
        "text": "Ardie and her two kiddies left last night and are now in San Francisco. The place is as quiet as a church. Seems lonesome, but it also seems good. I hope she and Frank can learn to overlook the things they see in each other that they don't like. I hope their marital years are much calmer than ours (Grace's and mine)."
    },
    {
        "date": "06-06-1948",
        "startPage": "101",
        "endPage": "102",
        "text": "At 2:30 this morning an officer at police headquarters called us on the phone and informed us that they had our boy, Harry, in the city jail charged with car prowling. He, Sonny came home this p.m., said that due to a lack of evidence they released the three of them; Dennis and Bill Worthen and Harry. He has stuck very close today. Maybe they put a scare into him.\\n\\tCathy and I went up to Hogle Gardens today and while there we saw the great Pioneer Monument for the first time. It is a magnificent monument. The three central figures, representing Brigham Young, Heber C Kimball and Wilford Woodruff, stand 40 ft above the walk. Western historic characters such as Peter Shane Ogden, chief Washakie, Captain Fremont, Father De Smet and Captain Bonneville appear in bronze relief on the east side.\\n\\tThe monument I observed does not stand true to the poles, to me it appeared to face a West, North Westerly Direction (towards the temple)."
    },
    {
        "date": "06-15-1948",
        "startPage": "102",
        "endPage": "103",
        "text": "A few days ago A letter came from Rowennah, which to my surprise, had been posted at Challis, Idaho, and had not been censored by the school officials. In it she pled and cried like a little child for her big brother to come and get her out of the dreadful place. Ellen and I seem to be the only ones who want to get her out. I immediately sent the letter on to my mother asking her if she didn't think the child had been confined long enough.\\n\\tA reply game today and to sort of confirm my suspicions, mother admitted that Lora didn't want anyone around who was \"off the beam\" as she put it. And since she, mother, is going to be dependent upon Lora, she is trading the freedom and affection of a sick child for her own security. \"security\"? Huh! I'll wager that she will find herself in an institution - a poor house if Lora don't like the way she acts, and old people often act funny. It will be the responsibility of one of her sons to care for her when she is old. I would do it and probably will, and gladly.\\n\\tThe problem now is how to get Rowennah out of that prison house. I have already taken the first steps; I have written the institution to learn what she is capable of doing and have made an appointment to talk with my Bishop about getting her employed, housed etc by the church welfare. If I go away, which eventually I probably will be forced to do if I am to avoid committing mayhem, then I would take she and Charles with me.\\n\\tHer welfare is subject of my prayers, surely the Lord will hear and answer me."
    },
    {
        "date": "06-24-1948",
        "startPage": "104",
        "endPage": "104",
        "text": "Painting, cleaning, remodeling, etc. has interfered with recordings in the old Journal, but I can't let this important anniversary day pass without an entry. it was 19 years ago today that I took my wife and three children to the temple. Grace and I received our endowments and she was sealed to me for time and eternity and her children were seal To us by the same authority, to endure throughout all the ages of time."
    },
    {
        "date": "06-25-1948",
        "startPage": "104",
        "endPage": "105",
        "text": "The paper hanger has finished the job of hanging paper in the two front rooms and our bedrooms; the carpenter has taken out the colonnade between the two rooms (before the paper was hung) the rooms are painted, the porch painted, a new modern screen door has been hung; Venetian blinds installed in the front room windows, new furniture has been purchased and delivered; the plumber has moved the hot and cold water to the new sink, which is part of the new kitchen cabinets just finished today (at a cost of $4.25). They cover three walls of the kitchen. All is complete except the paint yet to be put on the new cabinets."
    },
    {
        "date": "06-26-1948",
        "startPage": "105",
        "endPage": "105",
        "text": "Today we made arrangements for the linoleum to cover the drain boards of our new cabinets; also a man to lay it, which will cost us, in all, about $25.00.\\n\\tMy Heavenly Father has again answered my prayer just as he has done so many, many times in the past. He has opened the way for us to remodel our kitchen. If only now we could complete the job and have the bathroom done also."
    },
    {
        "date": "06-27-1948",
        "startPage": "105",
        "endPage": "106",
        "text": "This evening as I was walking to meeting some people called to me from their porch and what do you think? It was my Uncle Harry and Aunt Mary Robinson from Los Angeles. Uncle has retired from the National Biscuit Company where he has been employed for many years. They are visiting with relatives and friends in Utah and Idaho. They were visiting with Uncle Harry's brother who lives on the 1100 block on Ramona."
    },
    {
        "date": "06-28-1948",
        "startPage": "107",
        "endPage": "107",
        "text": "I am too sleepy to make an entry tonight."
    },
    {
        "date": "06-29-1948",
        "startPage": "107",
        "endPage": "108",
        "text": "Word came this evening from Ardie and Frank (a cable) announcing Ardie's safe arrival at Okinawa. She sailed from San Francisco June 9th and arrived on the 29th.\\n\\tOne of the young clerks Bob Smith, was grabbed last night after leaving the office by the inspectors and was lodged in the city jail, for rifling the mails. Over a period of one year, according to this signed confession, he had stolen between $500 and $600.\\n\\tWhat a shame. He has a wife and three children who are the real sufferers from his thoughtless evil acts. His life is wrecked. He will never be the same man he was before. Had he taken a gun and held up a business house or a bank it would not have brought the disgrace this rifling of the mail has brought.\\n\\tA robbing linoleum layer came out yesterday and granted us the outrageous price of $50 to lay the linoleum on our new drainboard. Instead of giving him the business I think Grace and I will lay it probably Monday.\\n\\tI probably won't be able to work anymore on Saturdays at the archive, due to a new ruling affecting part-time employees of the society. This means less money and may force me to seek other part-time employment where I can work Saturdays and holidays if I wish."
    },
    {
        "date": "06-30-1948",
        "startPage": "108",
        "endPage": "109",
        "text": "I want to put plastic tile on the walls between the drain board and bottom of the cabinets. It will cost approximately $25, but we are saving more than that by laying the linoleum ourselves. as soon as the linoleum is laid and the tile put on the cabinets will be ready for paint.\\n\\tThe new furniture sure sets off the front room beautifully. The dining set with buffet and six chairs also a large throw rug where delivered today.\\n\\tTomorrow I start a new year at the PO at top grade pay, which will be with the raise (which we hope the president approves with his signature real soon) $3,550 per year, $1,000 from the archive will make more than $5,000 taking into account about $30 per month for night differential."
    },
    {
        "date": "07-04-1948",
        "startPage": "109",
        "endPage": "110",
        "text": "Mother arrived in Salt Lake Friday evening. I met her at the Depot and sent her on home in a cab as I had to work. We had received a wire from Lora and on Wednesday announcing mother's arrival time. She looks well doesn't seem at all her age. She is going down to Richfield to spend her vacation while Art is having his. They are going up to Nampa thence to San Jose to take Mom back home. They are going to see if they can do something for Rowennah."
    },
    {
        "date": "07-05-1948",
        "startPage": "110",
        "endPage": "111",
        "text": "Yesterday our great country celebrated a most important anniversary. 172 Years ago the Declaration of Independence was drawn and signed, declaring this nation to be a free sovereign state independent of all ties, bonds and dependencies.\\n\\tToday mother, Grace and I cut and applied the linoleum to the drain board and put on the chrome trim. It sure looks good, matter of fact it looks professional.\\n\\tMother was 4 minutes late this morning. Her train, which I was sure left for Richfield at 2:10 a.m. pulled out at 1:30. So now instead of going down to Richfield she is going to wait here for Art and Bessie. They are going to pick her up in the morning on their way North.\\n\\tInasmuch as I have a 7:45 appointment tomorrow morning with Professor Holmes I had better get to bed.\\n\\tMy heavenly father heard and answered my prayer today. I asked him to help us put on the linoleum in a satisfactory manner. He indeed blessed us."
    },
    {
        "date": "07-11-1948",
        "startPage": "111",
        "endPage": "115",
        "text": "Our home is beautiful, especially the front room, the Venetian blinds, new paper, new dining set, new studio couch and chair to match, wood work enameled white (or near white) etc.\\n\\tSharon's bedroom is newly papered which makes it look nice and will look much nicer when new shades and curtains are hung.\\n\\tThe kitchen is still in process. The new cabinets haven't been painted yet. I am waiting until the tile, which I bought yesterday, is applied between the drain top and the bottom of the new cabinets. When that job is done I will begin putting on the prime coat, to be followed by a coat of Vermilion enamel inside and two additional coats, one of half sealer and half enamel and a third of an A1 grade of near white enamel outside. My heavenly father, to whom I had appealed for divine aid to modernize and beautify our home: and how marvelously he answered my prayers. I leave it to the reader to judge. First a fellow came in, got our signature and put a new composition roof on the house, which cost us $350 gross. Secondly; when we found that FHA money could be procured for improvements, we went down and borrowed $700 for remodeling and modernizing the home. Then thirdly we had to go back and borrow $150 additional to complete the latter job. So now we are back in debt, but so long as I can keep my part-time job it won't be hard on us. One payment we met on the 4th of the month $22.85 (we cash an $18.75 Bond and make up the balance from the paycheck). The second falls due on the 18th $9.99 we pay from the 17th paycheck and third is a $6.47 payment I make from the 28th paycheck.\\n\\tWe part-timers at the archive were told last month that our services would be dispensed with after June 1949, but in the six years I have been there such reports have often come out and always they have been forgotten. So I am not alarmed.\\n\\tConsidering the amount of money I owe and the monthly payments I have to make on borrowed money, I am perplexed about my forthcoming proposed trip East. If I postpone it until next may it is highly probable that by that time there will be conditions that will prevent me from going; maybe it will be a lack of Finance (as it is the present problem), it might be transportation problems, it might be domestic trouble, it might be economic troubles. I feel that if I can't go this fall I won't go next spring. But to go this fall is nearly impossible. I have to pay the collector of internal revenue $70 July 28th and about $75 August 28th. These two payments will of course eat up my two archive checks for those months, leaving only my September check to put in the vacation pot. Say I could put $75 into the pot September 28th and I could get Grace to send me $50 from the October 4 check. If I could save $25 from August 1st check in $25 from September 1st check and put this $50 in the pot I would have $175. The balance I would have to borrow. $50 I could borrow from Gus Thurgood. Maybe I could get $100 from Wilby Johnson, two leading shysters at the PO. This program if I could follow it out would give me $325. The railroad fare will be $115; rented cars will cost about $25; side trips by bus will cost $65, a total of $205. The balance for hotel, eats, sightseeing and other incidental expenses.\\n\\tMy heavenly father: please, in as much as you have always come to my rescue when I need  aid; I humbly petitioned the, to grant me the privilege of taking this long-awaited, much desired vacation trip. I ask it in the name of my Lord and Redeemer, Jesus Christ; Amen.\\n\\tBy leaving the city Tuesday Eve September 28th I could be in Denver Wednesday p.m. And Burlington Thursday a.m. and Chicago Thursday evening. I could be in Detroit Friday p.m. and Cleveland Saturday and buffalo Saturday evening and Sunday Rochester Monday and Albany on Tuesday and one week of the 3 weeks are passed.\\n\\tIf I leave Tuesday p.m. September 28th and I don't return to work until Monday October 18th at 3:00 p.m. That's 3 weeks, but I'm only taking two weeks (10 days) of my 15 days vacation. only Monday, Tuesday, Wednesday, Thursday and Friday are charged to annual leave."
    },
    {
        "date": "07-18-1948",
        "startPage": "115",
        "endPage": "115",
        "text": "Seems of late that one entry per week is about all I can find the time to accomplish. The beautification and remodeling project in our home plus two jobs - one of five to six hours and the other of 8 hours leaves no time for anything except a little sleep; 5 to 6 hours no more ever. "
    },
    {
        "date": "08-01-1948",
        "startPage": "115",
        "endPage": "117",
        "text": "25 Years of stormy wedded life came to a close last Sunday. I brought home Saturday night a few anniversary presents. Then during the week following Charles gave us another present, one of usual kind we get from our children - in fact the only kind - he was picked up by the police together with some other hoodlums for stealing two cars. He is now at the boys home awaiting juvenile court hearing tomorrow. I am not going to lift a finger to get him or any of my other worthless, disrespectful, inconsiderate kids out of any jams they get themselves into, through disobedience.   Come the summer of 1951 when I hope to be out of debt, except this home. Then I am going away. I'm going to desert this ungrateful house full of vultures who want all and who give nothing but trouble. By then Cathy will be 8 and will not be the problem she would be at 5. In 3 years Sonny will be 19 in Charles will be 17, both should then be self-supporting because neither will be going to school. Neither of them wants an education. They don't and won't understand it's value until they are men and they have to eke out a living with their back muscles."
    },
    {
        "date": "08-07-1948",
        "startPage": "117",
        "endPage": "118",
        "text": "It is raining cats and dogs tonight and Mama and Cathy are over at Sugarhouse to a show. If it hasn't stopped by 11:45 I will take the umbrella and Mama's raincoat over to 21st South and watch for them.\\n\\tI am home early this evening, only worked 6 hours 4:00 to 10:00 p.m. Will go in Friday and work 2 hours.\\n\\tBetty, Dot and Ardie gave us a beautiful Mixmaster for our anniversary. When the beautification work in our kitchen is completed we will have a very beautiful and very attractive home. But the Acme of perfection will not be realized until the bath and toilet rooms are combined and a new built-in tub and new pedestal Basin are installed; new floor covering in the kitchen, Hall and bath and tile walls in the kitchen and bath, from floor to wainscot. The partition now separating the bath and toilet will be moved about 2 1/2 ft to the East. This will allow a 2 ft closet along the east side of what is now bathroom. A linen closet opening from the bathroom and a large, spacious clothes closet opening from our bedroom.\\n\\tMost of this work I can do myself and save about $300 labor bill.\\n\\tLast night the letter carriers band gave away a new Pontiac car to the holder of the lucky ticket number. I prayed a number of times to my heavenly father, asking him to please let my number be drawn, but as I once said in a fast and testimony meeting, \"our heavenly father hears and answers all our prayers and all our requests but some times the answer is \"no\" and in my words, not his, \"it would not be good for you.\""
    },
    {
        "date": "08-13-1948",
        "startPage": "118",
        "endPage": "121",
        "text": "Cathy is ill, was running a temperature last night and has been indoors in her pajamas all day today. The genealogical society held its annual outing this evening at Lagoon and if Kathy had been well I would have taken her.    I wrote and posted a letter to Elder Joseph A McRae at Carthage Illinois who has charge of the old jail, which is an LDS Bureau of information. I asked his advice about how I could best reach Carthage and Nauvoo from Burlington or Keokuk Iowa. I also wrote the CB&Q passenger agent at Keokuk, asking him the same questions. Today I called at the office of the local CB&Q representative and asked him for the same information. He is going to write the passenger agents at Burlington and Keokuk. From one or more of these inquiries I should get the desired information.\\n\\tNext Tuesday morning I am going to take my driver's test at the state capital. A driver's license I must have, should I rent a car during my trip, which I will have to do in one or two places.\\n\\tThe railroad fare will cost me $10 more than I had anticipated. Instead of $115, it will be $125. The fare from Burlington to Keokuk and returning will be extra too; which will be about 3 to 4.\\n\\tOnly one thing can keep me from making this trip. Should the Spirit of the Lord caution me or object as it did upon once when I was about to enter a building, if that spirit says 'don't' then I won't, but otherwise, I am going to have to ride the rods and go ragged and hungry.\\n\\tMy proposed itinerary is as follows: Salt Lake City to Denver; Denver to Burlington, with a side trip to include Nauvoo and Carthage; from Burlington to Chicago. In Chicago, a side trip north to Milwaukee, WI. From Chicago to Detroit; from Detroit to Toledo and Cleveland, Ohio. Here a short side trip to Kirtland. From Cleveland to Buffalo with a side trip up to Niagara Falls. From Buffalo to Rochester. Here I rent a car and cover a number of nearby small towns; from Rochester to Palmyra with a short side trip to the Hill Cumorah and Sacred Grove. I am not opposed to selling this property. With the improvements we have made we should be able to get $13,000 without difficulty. The only drawbacks are a shallow basement and a converted furnace, and the back porch and garage. We owe about $3,800 on it plus $1,350 borrowed money. In addition, we owe about $250 in miscellaneous debts. Paying these off, buying a $1,500 used car would leave us about $8,000 clear to invest in a California home."
    },
    {
        "date": "08-17-1948",
        "startPage": "121",
        "endPage": "121",
        "text": "A quarter of a century has passed since that fateful day, Aug. 17, 1923. A month after our marriage, I went to work as an assistant shipping clerk and general flunky at Faciboule, Marse Theo, located at that time at 167 West 2nd South St. My starting pay was $75 per month. I worked for them for 10 years and when they closed their Salt Lake branch in 1933 and my services were no longer needed, I was only receiving $135 per month."
    },
    {
        "date": "08-18-1948",
        "startPage": "122",
        "endPage": "122",
        "text": "Babe Ruth, the Home Run King of baseball, is dead; died yesterday at the age of 53 from cancer. The Great World War I General John J. Pershing is also dead. He died on July 15, 1948. I served under this famous General during the few months I was in the service in 1918. I am attaching a short magazine sketch of his illustrious career as a soldier. It has been exceptionally warm today."
    },
    {
        "date": "08-19-1948",
        "startPage": "122",
        "endPage": "123",
        "text": "The CB & Q office called me today to inform me they had heard from their agent at Keokuk. He has made arrangements with a friend auto dealer in the town, for me to drive a car over to Nauvoo and Carthage. The cost will be only $300 plus the gas. The train fare from Burlington to Keokuk and return shouldn't be more than $3."
    },
    {
        "date": "08-20-1948",
        "startPage": "123",
        "endPage": "123",
        "text": "Took my driver's test today and passed it without a bobble, used Dick Bailey's new Studebaker convertible."
    },
    {
        "date": "08-21-1948",
        "startPage": "123",
        "endPage": "123",
        "text": "Worked 10 hours at the Archive today, but didn't accomplish nearly what I expected to. Harry Allen, a fellow clerk at the P.O., who is also a part-time real estate salesman came out to the house to appraise our home with the understanding that it will be listed with them for sale. I wonder what they will say it will bring on today's market? Sonny's bedroom, the kitchen, the bathroom, toilet, and two halls are to be papered and the kitchen painted; a built-in tub and basin installed in the bathroom and the old one removed. I wish I were a good carpenter with good tools. I could save myself a lot of money."
    },
    {
        "date": "08-22-1948",
        "startPage": "124",
        "endPage": "124",
        "text": "Harry Allen comes out today from the MJ Fuire Realty Co. to take the listing on this property. Instead of asking $12,000 as planned, he persuaded us to offer it for $10,000 to sell rather than not sell. This amount, after we clear the indebtedness against it and pay the F.A.Q., will leave us $4,775. Subtracting $700 for personal debts leaves $4,075, and $1,000 for a car leaves $3,075. Subtracting $250 to move and $500 for commission leaves us $2,325 to reinvest in another home, probably in California. After we dispose of this home, get our obligations cleared off and get settled elsewhere, our only expenses will be current living expenses: Home payments, groceries, house operating expenses like gas, light, water, telephone, car operation, and other incidental expenses. A total of about $50 per month under my monthly income."
    },
    {
        "date": "08-23-1948",
        "startPage": "125",
        "endPage": "125",
        "text": "Dorothy had a birthday today. She turned 23. Bryce and Craig were out here yesterday, but I forgot about her birthday until Mama told me at work today. We have three kids in their 20s now. I must get some paint before Saturday and paint the back porch and put some new screen wire up. Then I must begin painting the kitchen. When that is finished we will get some wallpaper and have Bruce, and maybe Moffit, come and paper it. The most expensive part of our beautification project is yet to complete: tiling the balance of the kitchen, the bath, and toilet room, in all about $150 worth of tile. I don't feel that we are going to sell this home, as the picture of a prospective buyer with cash doesn't seem likely."
    },
    {
        "date": "08-24-1948",
        "startPage": "125",
        "endPage": "125",
        "text": "I am too sleepy tonight to spend any time with an entry into the old journal. So, I'll just say hello and goodnight."
    },
    {
        "date": "08-25-1948",
        "startPage": "126",
        "endPage": "126",
        "text": "A letter came today from Ardie and Frank, with it came a picture taken as they left the boat at Okinawa. The kids, especially Barbara, sure look cute but tired. "
    },
    {
        "date": "08-26-1948",
        "startPage": "126",
        "endPage": "126",
        "text": "Autumn is in the air. Soon cold weather will be with us again, but I don't dislike the winters like I used to. With the listing of this property and its possible sale and the hurried quest for a trade in California thereafter, I shall be forced to postpone my vacation and any eastern tour until next May or until the home is sold. If and when we sell, we will buy a car and take this long-delayed trip east. If I were to drive east, I would go up through Yellowstone Park, then east through the Dakotas, into Minnesota and Wisconsin, then south to Nauvoo and Carthage."
    },
    {
        "date": "08-28-1948",
        "startPage": "126",
        "endPage": "129",
        "text": "A letter came today from Mother. It seemed erratic. When I read it, I wondered if this Rowenna ordeal was telling on her. I feel like writing Mother like this: I had nothing to do with putting that girl where she is (I understand Lora had something to do with that); if you don't want to take my advice, have the girl sterilized, as she has become a problem; have her released to Ellen, who in turn would hand her over to you. You need to come to Utah to make a home for her and you since Lora doesn't want her there. There is one thing more I want to tell Mother, and one thing more I want to tell Lora, and one of these days I'll get the two speeches out of my system. I want to tell Mother that the security she is getting from Lora will dwindle like a candle; it's that kind of security. She is buying it at the price of Rowenna's freedom. To Lora, I want to say, inasmuch as you have turned a cold, strange shoulder to the cries and pleading of an afflicted blood sister and have said in your heart, let her stay where she is, you too will one day be shunned by those to whom you are seeking sympathy. You will find yourself alone when you will need friendship, companionship, and help. I am going to call Bert tomorrow morning. Instead of waiting till tomorrow morning, I called him this evening and learned that his opinion of Rowenna's plight isn't as bad as I thought. He is going to write me a letter, telling me, as near as he can remember, the conversation he and my mother had with Dr. Allen at the school in Nampa. For Allen's reply to that letter I will forward to our Stake President. Bro. Elbert R. Curtis has been named by the First Presidency in charge of the new mission. Pres. Morris has been called to preside over the Eastern States Mission. Pres. Curtis' great-grandmother and my own great-grandmother were sisters and children of Pres. Brigham Young and his first wife Miriam Works. Elbert R. Curtis has brought honor, distinction, and glory to his lineage. I predict that Elbert R. Curtis will one day be named to a position among the General Authorities of the Church. God bless you, Bro. Curtis, in your new work. Heavenly Father: Please give me the strength and determination to live my religion, to do my duty in the Church, to be obedient, to be humble and faithful. Grant me a portion of thy divine power so that I shall walk in the path of rectitude and righteousness. I ask in the name of my Redeemer, that one day I may prove myself as faithful and devoted as has the servant of God, Elbert R. Curtis; Amen."
    },
    {
        "date": "08-29-1948",
        "startPage": "129",
        "endPage": "130",
        "text": "After Sunday School, Cathy and I went down to see Dan Brooks. He hasn't been at work for two or three days, so I called to see what his trouble was. Well, I knew from his time card that he was on sick leave and I knew from the last time I saw him that he was suffering from leg pains. He is in the hospital again. This time for observation. Maybe he has phlebitis, or maybe it's arthritis. He is in intense pain nearly every moment. Father in Heaven, please bless Jim Brooks, make him well again. He is not an old man, there is much that he can do among his brethren in the Church. He is a faithful member of the Church. His son George has just returned from the mission field; his homecoming is this evening in their ward at the Lincoln ward chapel. I ask this for Dan's wife and his good family, in Jesus' name. Amen."
    },
    {
        "date": "08-31-1948",
        "startPage": "130",
        "endPage": "131",
        "text": "With our house listed for sale and the possibility of moving to California, I have nearly been forced to postpone my proposed September & October trip east until next May, when we hope to have sold our home. I am not in favor of transferring or trading to California. I am not in favor of living in California, and I am not in favor of postponing my long-awaited vacation. But to keep peace in the family, I have agreed to trade to some District Office in California if and when we sell our home. It is late and I am very tired. "
    },
    {
        "date": "09-01-1948",
        "startPage": "131",
        "endPage": "132",
        "text": "Referring to last night's entry, I should also say I am not in favor of leaving Salt Lake. As I have often said on these pages, I would make my home in the east somewhere if my home life had become unbearable. Please, Heavenly Father, open the way so that I can still take my proposed eastern Genealogical Vacation, sightseeing tour of the east, the northeast, the southeast, and the south. From Sam Brook's wife I learned this evening that they still don't know what his ailment is. The doctor did say, however, that it was not phlebitis. He is in constant pain, except when he is full of opiates."
    },
    {
        "date": "09-02-1948",
        "startPage": "132",
        "endPage": "133",
        "text": "A family which lived across the street from us on 1st St, about 275 East, named Morrison, the father, mother, two children, and a boy about 18, a friend of the oldest Morrison girl, were all killed in a head-on collision, except the girl mentioned. She is in a critical and dangerous condition, still unconscious. The accident occurred a little way this side of Pocatello. They were returning from a vacation trip to Yellowstone.\\n\\tTook Charles to the Juvenile Court this morning where he told about his part in the theft of two automobiles, one of which was wrecked at a cost of 200 dollars. He was on probation and fined 60 dollars. Judge Clark made it very clear that if he got into any further trouble, he would send him to the Industrial School in Ogden. A warrant was"
    },
    {
        "date": "09-05-1948",
        "startPage": "133",
        "endPage": "133",
        "text": "Now that Sharon has gone, Grace will have to get used to having only Charles and Cathy at home now. As soon as this home is sold and the deal closed, I too am going away. I want to take Charles with me if he will come. I am planning to transfer to the Rochester, NY office. I got a mail letter from Mr. Rutz of that office yesterday. I am not going to spend the rest of my life disputing, quarreling, and fighting with my family."
    },
    {
        "date": "09-15-1948",
        "startPage": "133",
        "endPage": "134",
        "text": "My great-grandfather Howard was born 147 years ago at Ainsdale, Berkshire Co., a little place near Pittsfield, Harry and Phebe Eliza Colt Howard lived. He was descended from the founders of New England, more especially the founders of the Colony of Connecticut. He was a man of integrity, loyalty, and devotion to what he believed right. He was an officer of the Buffalo Savings Bank of Buffalo, N.Y., where they resided for about 20 years, coming there about 1840. They had five children, three of whom left posterity. At the time of his death, Great Grandfather had five grandchildren, two of whom resided in Utah."
    },
    {
        "date": "09-19-1948",
        "startPage": "134",
        "endPage": "135",
        "text": "Cathy and I went to the fair this day. Saw the exhibits, which I thought were quite interesting. They were interesting to stock raisers, farmers, poultry men, etc. What I had hoped to see was scientific and industrial developments. Went down to meet Will Holmes this morning for a vocal lesson but missed him, so I spent about 2 hours on my personal genealogical records. I have 486 completed family groups with all ordinances completed. I have only scratched the vast surface of vicarious work.\\n\\tThe vacation I had scheduled for next month, I am postponing until May. Of course, if our home sells in the meantime and I move to Rochester, I'll take the vacation after I leave here and before I start there."
    },
    {
        "date": "09-20-1948",
        "startPage": "135",
        "endPage": "135",
        "text": "Yesterday I posted a letter to Katherine and today I posted one to Mother and one to Dr. Allen of the State School at Nampa. Fall is certainly in the air, though it doesn't officially begin until tomorrow.\\n\\tWe haven't heard a word from Sonny and he has been gone two weeks. Don't understand why he hasn't dropped his mother a card. "
    },
    {
        "date": "09-25-1948",
        "startPage": "135",
        "endPage": "136",
        "text": "My vacation, which was scheduled for Oct 4th to 14th I have had to postpone until Apr. 25th, 1949. If our home sells we will have a car to drive back east. If our home sells it is my intention to trade into the Rochester, NY office. If Grace and Charles and Cathy want to make their home there with me, well and good but it will have to be east and not west.\\n\\tIf our home sells and sells at the price we ask, $9995 I want to pay off all our obligations, buy a car, and put about $2000 into a duplex or triplex and let the rentals pay for the property. We would rent and use the income for rent, groceries, and operating expenses. We should get along on $150 per month, put some in the bank, and enjoy some of the remaining years of our lives."
    },
    {
        "date": "09-26-1948",
        "startPage": "136",
        "endPage": "138",
        "text": "The furnace can't be lit until the new flue pipe is installed, which I intend to do tomorrow morning. We need the furnace on today as it's chilly. Charles is already in trouble at school, two weeks after it starts he gets expelled. The juvenile court is going to pick Harry up now that he is back in town. When they do, he will very probably go to the Industrial school because he hasn't paid the $300 fine assessed against him, and what's more, he was implicated in the theft of a truck since he was placed on probation. I am thoroughly disgusted and miserably disappointed in our situation. They have brought me humiliation, disgrace, and disappointment. The latest and most humiliating news was from Bishop Rawson that Charles, from substantial evidence (which Charles at first denied and later, when I questioned him, he closed up) had taken from fast offering envelopes he carried on his route last fast Sunday. I have been ashamed to show my face at the ward since; I think I'll change to another ward, perhaps the Bryant ward, located just north of 17th South. This afternoon, Cathy and I went up to see the old home on State Street. The house has been painted white with dark red or brown trim. Francis, City Section Foreman; Will Butterworth, Central Superintendent of Mails in charge of Carriers; and Horace Goodfellow, a clerk, are retiring September 30th. These men will, when they leave the service, make the opening on the Clerks' register. Well, Butterworth, having once been a carrier, his position will be filled by a promotion of a fellow (Del Rayner) who was once a carrier. This one retirement does not affect the clerks' register, except that there will be a foreman of carriers P.O. Division selected from the carriers who bid for the job vacated by Del Rayner (Ralph Jones). His name will be moved from the carriers to the clerks' register. All executive positions are filled by clerks, and whenever a carrier is appointed to an executive job, he is automatically made a clerk, and his name is placed on the register of clerks."
    },
    {
        "date": "09-28-1948",
        "startPage": "138",
        "endPage": "140",
        "text": "This is the evening I doted so long on leaving. For months I planned and laid out the details of the eastern vacation. Now I am forced to postpone the trip for seven months. Probably long before that date, this home will be sold and I will be working in some eastern office. Our domestic relations keep getting worse. The mental anguish is getting more than I can bear. I would, if I followed my inclinations, shut my eyes to my responsibilities, obligations, etc. and leave my home, and go far, far away and stay away, where no nagging, chastising, or fault-finding is heard, where I can live in peace and quiet.\\n\\tToday is an anniversary in the annals of the Howard family. Three hundred years ago today, on September 28, 1648, my sixth great-grandfather, Henry Howard, and Sarah Stone were married in Guilford, Connecticut. Sarah was a daughter of John Stone and a sister of the renowned Rev. Samuel Stone of Hartford. Henry's parentage, etc. I have never learned. It seems he was an orphan, since he came to the new world at the age of seven years with John Barnard and wife. John calls him his kinsman in his will."
    },
    {
        "date": "09-30-1948",
        "startPage": "140",
        "endPage": "140",
        "text": "Tonight, had my travel plans materialized, I would be in Chicago, having spent the day visiting in and around Nauvoo and Carthage."
    },
    {
        "date": "10-03-1948",
        "startPage": "140",
        "endPage": "141",
        "text": "The 119th Semi-Annual Conference of the Church came to a close this PM. I did not attend a single session. I wanted to attend the general priesthood Conference, but I had to go back to the archive and pick up the laundry I had forgotten so that my son could have a clean shirt for the evening. Today, I have not been in a good mood due to the same cause of all my unhappiness, discontent, and bitterness. Cathy and I spent most of the day away.\\n\\tAfter a three-day rest, two days of which I worked on only one job, and today on neither, I return to work for another week of long hours. My weekly average is 10 hours plus.\\n\\tI hope this house sells within the next three months. I will cut the price some if by doing so it will move."
    },
    {
        "date": "10-07-1948",
        "startPage": "141",
        "endPage": "142",
        "text": "Bruce Moffitt came out this morning and papered the kitchen. He is coming back tomorrow morning and will paper the back hall. The kitchen looks beautiful. The front rooms look much different since Grace has hung the drapes. She worked yesterday and today preparing them.\\n\\tWe have had a formal, legitimate offer for the home. He offered $1500 down and the balance at $65 per month for 14 years. We are going to decline it and stick to our stipulated sale agreement of $4800 cash and $5200 mortgage, which is too little for this home the way it looks tonight.\\n\\tWe are trying to refinance our FHA loan by consolidating it with the unpaid balance of the mortgage. This would reduce our monthly payments by $40."
    },
    {
        "date": "10-10-1948",
        "startPage": "142",
        "endPage": "142",
        "text": "I think that next Sunday, I will attend the Bryan Ward. I have not felt free to attend any Sugar House ward services since my son was found to be a thief and my Bishop knows about it and I can't face him. "
    },
    {
        "date": "10-11-1948",
        "startPage": "142",
        "endPage": "143",
        "text": "Today is my birthday. I am reaching that point known as middle life. The little farming community where I was born was only about 15 years old when I was born and ushered into it. My mother sent me two birthday cards, which seems a bit strange. Of late, she has been doing some strange things. The Prudential Federal Corp. notified me today that they had approved my application to refinance the F.H.A. loans against our home. The combined F.H.A. & mortgage payments, he told me, would be $51.50 per month for 135 months; a little more than 11 years. This deal has been the subject of my prayers for many days. My Heavenly Father has again heard and answered my prayers, for which, Father, I am most grateful.\\n\\tSeveral days ago, I sent Bishop Rawson the $5.11 Charles had pilfered from fast offering envelopes. I can't go back to that ward and face those brethren, the bishopric, who know I have a petty larceny son. They don't know the half of it. "
    },
    {
        "date": "10-13-1948",
        "startPage": "143",
        "endPage": "143",
        "text": "The weather is beautiful, an ideal late summer."
    },
    {
        "date": "10-16-1948",
        "startPage": "143",
        "endPage": "144",
        "text": "My wife, in spite of the fact that she worked for the church among some of the best people in the church for a year and a half, is a cigarette smoker. This I have suspected for some time and my suspicions are now confirmed. I am upset and undecided what to do. It doesn't seem I'm concerned about little Cathy growing up under an influence of such a nature. Would I be justified in taking her away, for her sake, and rear her under a more wholesome influence?"
    },
    {
        "date": "10-17-1948",
        "startPage": "144",
        "endPage": "148",
        "text": "My two boys are worse than no sons. They are disobedient, disrespectful, and deceitful. They lie, steal, and cause continued trouble in the home. Neither of them came home last night and neither of them took the trouble to call home to tell us where they were. Harry was kicked out of school because he would do nothing in school, coming home with nothing on his report card but \"E\"s. Charles had to be transferred from the firing line of being kicked out of school. I haven't the remotest idea that he will do any better at Roosevelt either. It seems to me that these last three children, Sharon, Harry, and Charles, are social misfits. They don't seem to be able to adjust themselves to boys and girls their own ages. I'm thoroughly disgusted with the whole situation. I'd like to give Cathy an even break in life's struggle by taking her away from this hellish mess. If something isn't done, she will grow up to be as bad or worse than her brothers and her sister.\\n\\tMy home is an example of what happens to an LDS home where family prayer is not practiced, where the garment of the holy priesthood is cast off, where the mother and wife is without faith, who violates the Word of Wisdom, and who speaks slightingly of the leaders of the Church.\\n\\tThis is the kind of a home I want to take Cathy and myself out of, where I can find peace of mind and she can too. Maybe I have failed in my duties as a father, but let anyone who judges me as a failure try the same job with the opposition I have had. My wife has pulled against me all these many years. We have quarreled almost constantly, never seeing eye to eye on any subject of importance. I have tried to live my religion, tried to keep active in the Church, and have always been active in providing for my family.\\n\\tEarly in our married years, I tried to have family prayer, but my wife was not interested and never lent a cooperating spirit. I wanted us to work together in the Church, but she would not. The only time I recall her ever manifesting any interest was upon the occasion when Bishop Smith came to administer to her way back in 1928 when her life was in danger. When she had recovered, she forgot the promise she had made that we would get busy in the Church together.\\n\\tThe following year I took her to the temple and we were sealed for time and eternity by the authority of the holy priesthood. Almost from that day until four years ago when she finally took off her garment, she poked fun at it, cursed it and said I had taken her to the temple against her wish.\\n\\tIf one of our daughters had planned to marry a fine young man in the temple, I am sure she would have attempted to discourage the plan on account of the garment. Now she smokes, drinks, and since I first knew her, has been a coffee drinker. Of late years she profanes the name of Deity in the presence of her family. When she is angry she can out curse any prostitute or woman of the street.\\n\\tAll of our major troubles have come in these past four years since she has not worn the temple garment. First, she started stepping out on her husband, drinking, and then asked if she could take off the garment. Dorothy disliked it from the start, fought against it, and eventually would have taken it off with or without my consent anyway. Then Sharon got into trouble. Then, in desperation and after repeated threats, I also started stepping out. Well, we ironed these evils out and both devoted ourselves to each other. Then Sonny got into trouble when, according to his account, he stole three cars in rapid succession, then Charles was hauled into court for participating in the theft of two cars. Then the last blow was struck when Sharon confessed she was in trouble again.\\n\\tNow, I ask, what would the censurer of my acts do if he or she were in my shoes? While Harry was on the board of the Juvenile Court on probation, he participated in the theft of a truck last March, for which he has not yet stood trial, but soon must."
    },
    {
        "date": "10-18-1948",
        "startPage": "148",
        "endPage": "149",
        "text": "Cathy has been ill for a few days, with fever and a bad throat. She was better yesterday but not well. Grace and I went downtown yesterday. I have to take her somewhere every Sunday. Perhaps she will be well enough to go to school tomorrow. The doctor said she must have her tonsils removed.\\n\\tGrace and I have been to the Prudential Federal, borrowed $1,111, with which we paid off the three FHA loans which totaled $1,073. The new mortgage is now $5,150. This will be paid off at $51.50 per month for 135 months, plus $8.55 taxes, plus $0.95 fire insurance, making a total payment of $61 per month.\\n\\tThis much desired deal being closed is a direct answer to my prayers. My Heavenly Father has been very good to me. How he will bless me with his spirit to inspire me and encourage me to show my appreciation by being obedient. It's his will."
    },
    {
        "date": "10-19-1948",
        "startPage": "149",
        "endPage": "149",
        "text": "Sent Bishop Rawson my Welfare Assessment ($10) today and told him I would pay my Ward Maintenance \"soon\". It is 1:00 AM and I am sleepy."
    },
    {
        "date": "10-24-1948",
        "startPage": "149",
        "endPage": "151",
        "text": "I have been making new and fresh plans for my forthcoming spring vacation.\\n\\tThe round trip railroad fare will be $125, plus $25 for a side trip by rail from Kansas to Jucimcare, N.M., thence northwest via C.T.B. to Denver. This part of the tour is as yet uncertain. I might take a bus from Garden City, Kan., to this point in N.M., carrying me through Oklahoma, Texas, and into New Mexico. In addition to the 13 states I have been in, this trip will take me into Wisconsin, Indiana, Michigan, New York, Vermont, Massachusetts, New Hampshire, Maine, Rhode Island, Connecticut, New Jersey, Delaware, Maryland, Virginia, and North Carolina. 18th North Carolina; 19th Georgia; 20th West Virginia; 21st Kentucky; 22nd Tennessee; 23rd Arkansas; 24th Mississippi; 25th Louisiana; 26th Alabama; 27th Florida; 28th Oklahoma; 29th Texas; 30th New Mexico; District of Columbia and Canada. Oregon, Washington, North Dakota, South Dakota, and Minnesota will then be the five states I have not seen.\\n\\tInto 30 states, District of Columbia, and Canada for less than 300 dollars, I'd say it was a whole of a bargain. Along the Atlantic coast from Portland, Maine to Savannah, Georgia.\\n\\tOf the 92 American cities with more than 100,000 population, I will have been in New York, Philadelphia, Los Angeles, Cleveland, Baltimore, St. Louis, Boston, Washington D.C., San Francisco, Milwaukee, Buffalo, New Orleans, Cincinnati, Newark, Kansas City, Rochester, Denver, Louisville, Portland, Jersey City, Memphis, Toledo, Providence, Omaha, Syracuse, Worcester, Richmond, Hartford, Grand Rapids, New Haven, Salt Lake City, Bridgeport, Albany, Trenton, Kansas City (Kansas), Erie, Wilmington, Elizabeth, Sacramento, and Utica. Nearly half of the country's largest cities.\\n\\tAs I started to say my RR fare will cost 125 dollars, plus 22 dollars = $147. My bus fares for round trips to and from Albany to Bennington, VT; from Boston to Portland & return; from Bridgeport to Hartford; from Washington, D.C. to Savannah; and from Savannah to Pensacola. All will cost 65 dollars, a total of 212 dollars plus $100 for misc expenses, a total of $312."
    },
    {
        "date": "10-31-1948",
        "startPage": "151",
        "endPage": "152",
        "text": "The weather is Indian Summer. Warm and sunny.\\n\\tMama and I painted the woodwork in the back hall last night. It sure looks nice now. The baseboard and the front and side cupboard doors haven't been painted yet, nor have the insides of the cupboards, which will be quite a job. Then too, the tile, which we already have, has to be applied to complete the kitchen project. Oh yes, the electric outlets for the stove and fridge haven't been installed yet."
    },
    {
        "date": "11-01-1948",
        "startPage": "152",
        "endPage": "154",
        "text": "Above is a clipping handed to me by Vera Moore who, knowing of my relationship, thought I would be interested. From Genevieve Curtis I had previously been informed of the undertaking. As a matter of fact, I was asked to contact all of our kin in an effort to raise part of the cost, and was told I would be criticized for such a request in my own family, such as my own father, who is buried in Lewisville, has no stone or marker at his grave. I also told Genevieve that President Young was the wealthiest man in the territory for many years and if he had wanted a stone placed at the grave of his dead wife, he would have taken care of it himself. And I still think I am right in that.\\n\\tTomorrow is a presidential election day. I am still a little dubious about how my ballot will be cast. Mr. Truman has made many blunders, has made an ass of himself on a number of occasions and probably is not a smart politician and is not an outstanding leader; but I feel sure he is honest, sincere and has the best interest of his country at heart. Thomas E. Dewey is smart, a clever politician, evades issues, makes no commitments and says nothing that can be termed an out and out statement of his intentions. Then, there may be possible serious reaction to a change of White House policy at this moment; a depression could easily hit. So, I think after due consideration of both men, disregarding the opposite political views, I'll cast my vote for Harry Truman."
    },
    {
        "date": "11-02-1948",
        "startPage": "154",
        "endPage": "155",
        "text": "Strongly, as I wrote last night about Grandma Smith, she was dead; had passed away at 7:50 p.m. Her suffering and helplessness are now at an end. I am thankful that our Heavenly Father has called her from earth life. What a happy reunion must have awaited her, her devoted husband, four children, and her parents.\\n\\tToday was election day. It looks like Truman will win the presidency of the United States. I voted for him, the first Democratic nominee I have voted for since Al Smith who ran against Herbert Hoover in 1928.\\n\\tI am considering taking some annual leave days and working a few extra days to make the time work out."
    },
    {
        "date": "11-03-1948",
        "startPage": "155",
        "endPage": "156",
        "text": "Harry Truman succeeds himself as president of the United States. Alben W. Barkley is Vice President. A majority of Democrats were elected to the House and Senate.\\n\\tHerb Maw was defeated by Bracken Lee as Governor of the state.\\n\\tI called in at the Smith home today and saw Grandma's wasted remains. She died very quietly, just slowly stopped breathing. What a happy reunion on the other side when her righteous husband, sons, daughters, and parents met her."
    },
    {
        "date": "11-04-1948",
        "startPage": "156",
        "endPage": "157",
        "text": "This afternoon at 1:00 was held the funeral of Sister Josephine Croesbeek. I attended. It was, I believe, the most impressive and nearest to perfection of any funeral I have ever attended. The funeral service of Sister Josephine S. Smith was one of the most impressive services I have yet attended. President George Albert Smith was one of the speakers. His opening remarks were that although it can't often be said that a person speaks at the funeral service of their mother, Sister Josephine S. Smith was, in reality, not his mother. He was born to the first wife of Pres. John Henry Smith.\\n\\tToday, it seemed that he, Pres George Albert, brouth to us gathered there a bit of heaven. Maybe I should say he bing the Lord's prophet, brought a bit of heaven to us gathered there.\\n\\tIn my opinion, no grander LDS woman has graced the Church than Sister Josephine S. Smith. She was my ideal of what a mother and wife should be - sweet, kind, friendly, helpful, full of faith, devoted to her God, her Church, her husband, and family, and humble. One of God's noble spirits, a mother in Israel, has been called back from mortality to the place we call Paradise. God bless her memory and may He bless her surviving posterity that they may add glory to her glorious name and honor to the believing blood that courses in their veins.\\n\\tToday we have had our first winter-like weather. It has been cold all day."
    },
    {
        "date": "11-05-1948",
        "startPage": "157",
        "endPage": "157",
        "text": "The realtors who have our place listed for sale are holding an \"open house\" here Sunday between 2 and 6 PM. They don't want any of the family around during that period. I hope it sells. I am miserable and unhappy. I'd like to sell the home, pay off my few obligations, give the balance to Grace, and leave. The two boys don't need parents. They need the discipline of an institution for a few years to teach them what a home and parents are worth."
    },
    {
        "date": "11-06-1948",
        "startPage": "157",
        "endPage": "158",
        "text": "I know winter is near at hand. Before another winter comes, if we still own this place, I plan to install a new suitable gas furnace that will heat the entire house.\\n\\tIt was my turn to work a Saturday today. I worked Saturday, will be off Sunday, work Monday. I will be off Tuesday (comp day), work Wednesday and will be off Thursday (holiday), work Friday and will be off Saturday. "
    },
    {
        "date": "11-07-1948",
        "startPage": "158",
        "endPage": "158",
        "text": "Harry Allen, the real estate agent, I guess has been here today conducting a house tour. Cathy and I left before he arrived and when we arrived home, mom was away, not having gotten home yet from Lucille's where she spent the afternoon.\\n\\tIt is cold tonight. It has been cold.\\n\\tFred J. Heath, a Salt Lake City and Holladay insurance man since 1922, suffered a stroke Wednesday in a Salt Lake hospital. Fred Heath, who I thought had died several years ago, died last September. He was a good man and a faithful LDS. He once lived in Sugar City, Idaho, where I first knew him when I was just a boy. He operated a general store there.\\n\\tI later contacted him through the Church Welfare program."
    },
    {
        "date": "11-08-1948",
        "startPage": "159",
        "endPage": "159",
        "text": "Harry Allen had four different couples here yesterday, they all thought it was a beautiful home. Two couples were willing to make a $1500 each offer and the balance deferred payments, which we would not accept. There was one couple willing to make a $2500 or $3000 offer, but nothing definite as of the open house.\\n\\tIt is late and I am tired and sleepy.\\n\\tIn 22 weeks from tonight, I expect to be on my way east."
    },
    {
        "date": "11-09-1948",
        "startPage": "159",
        "endPage": "159",
        "text": "Attached is a somewhat detailed map of a piece of country I hope to see next spring. From Albany down the Hudson to New York and back.\\n\\tFrom this map, it will be seen that from Albany to Pittsfield is about 50 miles. Hinsdale lies about 8 to 10 miles east and north of Pittsfield."
    },
    {
        "date": "11-10-1948",
        "startPage": "159",
        "endPage": "160",
        "text": "The weather continues mid winter-like. We are going to have a long siege of winter if it is to begin this early.\\n\\tTomorrow is a holiday. No work on either job; though I plan to put in a couple of hours at the Archive doing some work on my records.\\n\\tA fellow clerk at the P.O. comes out tomorrow P.M. to push the aluminum liner in the stock - I hope."
    },
    {
        "date": "11-11-1948",
        "startPage": "160",
        "endPage": "160",
        "text": "Today is 'Armistice Day'; such a title for a holiday is astounding. The great and final day, they said way back in 1917-1918, to end all wars was then being waged. Since then the most of the civilized world has undergone another terrible war and at this time a certain nation is striving to keep the western part of Europe, England, and Germany in turmoil so they can achieve one goal, to communize the entire Europe and then the U.S.\\n\\tWe have had a most bitter quarrel today. The worst, I believe, of any thus far. So bitter that I am planning to quit my jobs, draw what savings I have and take Charles and go back east, away back east. "
    },
    {
        "date": "11-12-1948",
        "startPage": "161",
        "endPage": "161",
        "text": "Grace's condition worries me; she definitely is in the change of life and is in a very serious nervous condition. We, the boys and I, must show her every kindness, even though she may be irritable, vicious, and mean. Sonny is the worst offender. Something must be done at once to stop him from upsetting his mother. I am going to try to get him into the Navy. There he could learn a trade, learn discipline, and be free of the juvenile court mandates. I believe we could stretch his age two or three months to make him 17.\\n\\tMay my Heavenly Father bless me with determination to not get angry at my wife's insults, nagging and fury. And please help Charles and I to get him readjusted in school with the type of program he will like, and that will be beneficial to him in later life."
    },
    {
        "date": "11-14-1948",
        "startPage": "161",
        "endPage": "162",
        "text": "Cathy and I went to Sacrament Meeting this evening. It was ward conference. I was grateful for the privilege of being present and partaking of the sacrament, and the fine spirit present. One of the speakers was Bro. Sharon T. Tanner, an old friend from the 13th Ward days; he was then in the bishopric of that ward when we met in the 20th Ward chapel."
    },
    {
        "date": "11-17-1948",
        "startPage": "162",
        "endPage": "162",
        "text": "It is cold tonight. It snowed early this morning following an electrical storm of rain then hail."
    },
    {
        "date": "11-21-1948",
        "startPage": "162",
        "endPage": "164",
        "text": "Had my father lived, he would have been 78 today. It is also Willard's birthday; he was born in 1912.\\n\\tI have been seriously contemplating quitting my Archive job on the 25th and my P.O. job on the 30th. I would take my two checks and buy a bus ticket back east, find a job, get a small apartment, and send for Charles. Later, try to get reinstated in the postal service in that or some other city. Then, still later, I could get my mother and sister Rowennah to join us. I would give Grace my equity in this house; let her sell it or keep it. If she sold it, she could keep the proceeds and welcome. I can't stand the constant hell she and my disgraceful son cause. It's unbearable. I have said this many times, and each time I have meant it, but always there has been a certain duty or honor or something that has kept me chained. I have been called 'low brow', 'dishonorable', 'Grandad Myler', 'Hygiene Derby', and heaven knows what else. If any future reader wishes to know how I feel, let him or her look back to these pages, to Oct. 17th of this year.\\n\\tIn accordance with my prayers, I am making good progress with my genealogical work; I need to spend at least one day or maybe two days doing some intuitive research in the library. One day this week, maybe I could devote to surveying records. By the time I have gone entirely through the records, making additional family group sheets for the many, many uncles and aunts with their respective wives and husbands and children, I think my record will have maybe 600 family group records. I am now working with the Is, hardly halfway through. This project, which I started quite a long time ago, has added some one hundred or more additional family groups to my already comprehensive record.\\n\\tIf only one of these days my Heavenly Father would guide me to the records of my English Howard ancestors and my Irish or Scotch Henry ancestors. Specifically the factors of Henry Howard (1627-1699) and Michael Henry (circa 1760-1810). How grateful and how thrilled I would be."
    },
    {
        "date": "11-25-1948",
        "startPage": "164",
        "endPage": "166",
        "text": "For the past four days, I have been close to home, having been hurt in a freakish little accident in which the pupils of the left eye were affected. My eye was scratched by Cathy as I was lacing her shoes she slipped her finger into my eye. Over the years, I have had several issues with my eyes, almost always the right one, getting infected. This time it was the left one.\\n\\tToday, the family dined in grand style. The new dining set, the new silverware, and the new dinner set added class with a capital C to our dining style and a very fine well-prepared meal.\\n\\tToday, in answer to an ad found in the July issue of the Union Postal Clerk, I wrote a clerk in St. Louis who wanted to trade to a high altitude midwest city. I asked if he was still in the market and interested in coming to this beautiful city of 4800 ft altitude. I told him I should hear from him within a week. It would be much wiser to trade with some eastern clerk and keep my job with retirement benefits rather than quit, hoping to be reinstated someday. I'll 'sweat it out' as the saying goes, and hope and pray for a suitable trade. When it comes, Charles and I will leave via the back door, so to speak.\\n\\tTo say that Grace and I are not meant for each other is pulling it mildly. We don't seem to agree on a single issue of importance. Well, what's the use of rehashing this old problem over and over.\\n\\tThese four days I have been off work have seemed like four weeks."
    },
    {
        "date": "11-26-1948",
        "startPage": "166",
        "endPage": "169",
        "text": "Today, I went into the printing shop on east Broadway. Met Ileen Griffiths Lloyd. It was the first time I had seen her in nearly 35 years. I can recall her only on one occasion: it was after Sunday School (of course, I must have seen her many times during my youth, as we grew up in the same town) when I was a kid about 14 or 13. My cousin Will - Dick, as we called him, was with her and was going home with her. She was a pretty girl, with black hair, brown eyes, and olive skin. This is the girl Will should have married and would have married but his father, with a superior air, drew the boy away from her when he thought they were getting serious and sent him on a mission which Dick botched, and botched his entire short spanned life thereafter. He fell under the spell of the womanly wiles of one Esther Burton, in or near Galveston, Texas. He was a fool. He didn't make such an important matter a subject of prayer. In fact, he was a fool because he disobeyed the counsel respecting attachments while serving in the mission field. He was dishonorably released from his mission, came home, brought his bride with him, and nearly broke his parent's hearts.\\n\\tIn a few short years, he had tired of her. She had become the opposite, instead of keeping his interest, she lost it. Soon he began seeking the company of other women. Of his immoral conduct, I know nothing until up to a time say about 1920-21 (he had then been back from his second mission - he having even gone back into the same mission and did a splendid job - about four or five years ago, he went to Provo where he met a girl whose name I do not know. They lived presumably together as man and wife. They had an illegitimate son by him who still lives in Provo, so far as I know, and from a picture I have seen, he is the image of his father.\\n\\tWill died in February 1922 following a tonsillectomy. The wages of sin is death.\\n\\tI had the impression as a lad when I saw them together that Sunday that she was the one for him, and if he had married her, he would be alive today, a stalwart Latter-Day Saint with a home, family, and the respect and love of all who knew him, for Will Selck was the kind of fellow young and old sought after; it was good to be in his company. To me he was an ideal.\\n\\tIn 1919 when his sister, Millie, was married, I went up to Lewisville from Idaho Falls where I was then living. I was a young smart aleck who had taken up the cigarette habit. I recall how disappointed I was when he asked me for a cigarette as we rode along in his car. Of course, I said nothing. I learned the following year that smoking with him was only a minor vice.\\n\\tIt is tragic. Each time I think of him, as I did today after talking with Ileen, who, by the way, is a widow and has been for many years; as I was saying, each time I think of Dick Selck, I am reminded of what could have been and am so terribly sorry about his downfall, as though it had only happened yesterday. Then I say, \"What's the use of crying over spilled milk\" and What's the use of hurting myself by constantly bringing up afresh the panorama of his tragic life. I only hope that sometime, somewhere, I can be of some simple service to him or his children.\\n\\t If I learn one simple lesson from the life of my cousin: obedience and the calamity which may follow disobedience. Probably his first mistake was failing to seriously and prayerfully set out on his mission."
    },
    {
        "date": "11-27-1948",
        "startPage": "169",
        "endPage": "170",
        "text": " It is cold tonight, probably the coldest of this wintry month. Last night was extremely cold too.\\n\\tI bought a beautiful two-tone door chime some time ago but lack the knowledge to install it on the living room wall.\\n\\tI am not sure of the outcome of the inquiry about St. Louis Clerk by Monday. This magazine in which the ad appeared had last July's and last listing. It is very possible that he has already found a trade and has moved west. In which case my letter will go to the dead letter office perhaps, as it had no return address on it.\\n\\tIt was my turn to work a Saturday today. I will be off nex Friday, my \"comp\" day.\\n\\tI am too sleepy to do any writing tonight."
    },
    {
        "date": "11-28-1948",
        "startPage": "170",
        "endPage": "170",
        "text": "The day has been utterly wasted, not one thing, one good thing, accomplished."
    },
    {
        "date": "12-03-1948",
        "startPage": "170",
        "endPage": "170",
        "text": "A reply was received yesterday from W. Dillard, who saw the blind ad in the issue of the Postal Clerk. He has a 4-year-old son who is an asthma sufferer which prompts the bid for a trade to a high altitude. Save for the Negro condition I think I'd like St. Louis. It doesn't get very cold there but it gets mighty hot in the summer."
    },
    {
        "date": "12-04-1948",
        "startPage": "170",
        "endPage": "171",
        "text": "About 15 inches of snow lay on the level tonight. It snowed nearly all night last night and went well into the afternoon today.\\n\\tI am going to answer Mr. Dillard's letter tomorrow. I'll have to go down to the P.O. to write the letter as I left his letter in my locker – I hope.\\n\\tI didn't get enough sleep last night and I am very sleepy tonight. Since it is after 1:00 am, I am going to lay the pen down for tonight."
    },
    {
        "date": "12-05-1948",
        "startPage": "171",
        "endPage": "173",
        "text": "Attended Sunday School and fast meeting. Bore my testimony, thanked my Heavenly Father for His goodness and kindness to me and for the miraculous way He has answered my prayers.\\n\\tI say again tonight - and I leave it on these pages - my Father in Heaven has been very good to me, especially so when I consider my unworthiness and my slothfulness.\\n\\tI am thankful that I was privileged to come into the world when the Gospel is upon the earth, and the holy priesthood; the authority to speak and act for and in behalf of God, the great Elohim, the maker and framer of the universe. Whoever bears the holy priesthood of God is a multiple or a part of God Himself. If we bearers of the priesthood would always think of ourselves as Gods in embryo, as individual parts of God - if I can make myself clear! I say, if we thought ourselves as holy vessels of God, then how could we defile ourselves? How could we be carnal, devilish, unclean? How could we be drunkards, and how could we ignore the Word of Wisdom? How could we be thoughtless of His love and care and turn our backs upon Him? I seek to satisfy our natural lusts. God has said through his servant of old, 'the natural man is an enemy of God.'\\n\\tMy Heavenly Father, I petition thee to remember me, since I am weak and thus among those who need strength and fortitude to keep my feet from forbidden paths. Grant me added strength in every moment when I most need that strength, when I might otherwise fall, being unaware of the nearness of a pitfall. I have a worthy ambition: an ambition to be counted a worthy Latter-Day Saint and to be free from debt, lacking in faith; hear me, Heavenly Father; please show mercy unto thy humble servant, deliver me from debt and help me to be a stalwart, liberal, tolerant, faithful, and obedient saint. I pray in my Redeemer's name: Amen.\\n\\tI am too sleepy to write more tonight. Tomorrow brings another set of long hours."
    },
    {
        "date": "12-06-1948",
        "startPage": "173",
        "endPage": "173",
        "text": "Real, honest-to-goodness winter has been with us for some time."
    },
    {
        "date": "12-10-1948",
        "startPage": "173",
        "endPage": "173",
        "text": "Horace & Millie Clement were in town yesterday, stopped over on their way up north to see Horace's father, who is dying. Millie said he lives in Bicksville. I didn't see either of them.\\n\\tMillie told me our Aunt Eliza Irby is dead, died about ten days ago while visiting her daughter Juanita in Idaho, Utah, Nevada, or California, I am not sure where. I heard her husband, Bill, is also dead. He was in bad shape the last I heard.\\n\\tI have never made a family group sheet for the Irbys because I didn't know the names of all the children and none of their birthdates. Aunt Eliza was born in Clarkston in 1880, making her 68."
    },
    {
        "date": "12-13-1948",
        "startPage": "174",
        "endPage": "174",
        "text": "The Christmas rush is fast approaching.\\n\\tMy old time friend, Joe Richards; Sunday School teacher, ex-bishop, seminary teacher and attorney; died about two weeks ago at the Veterans Hospital. Today, his widow Romay lost her mother while Joe's remains were still unburied. Joe had recently returned from a mission to the Central States.\\n\\tMay our Heavenly Father bless you, Romay, assuage your heavy heart and give you many years of happiness, peace, and security.\\n\\tZella and Josephine Smith, two of our children, are on their way to Texas where they will spend Christmas with their brother, accompanied by their older brother, Pres. Beadge Albert Smith."
    },
    {
        "date": "12-18-1948",
        "startPage": "174",
        "endPage": "174",
        "text": "We are in the midst of our annual Christmas rush at the post office.\\n\\tThree-quarters of a century have passed since that ancient day, Dec. 17, 1873, when my grandfather Howard died up in Bingham Canyon. He was but a young man, vigorous, and full of promise."
    },
    {
        "date": "12-19-1948",
        "startPage": "175",
        "endPage": "175",
        "text": "It seemed like a Monday because I worked 11 hours.\\n\\tOur son-in-law, 'Windy', called from Memphis, Tennessee, this evening to announce the birth of a baby girl to him and Betty. Both are okay. This is our fourth grandchild, two boys and two girls."
    }
]